{"data": {"quadriceps": [{"muscle": "quadriceps", "guide": ["Position your feet into a slightly wider than shoulder width stance with your toes slightly pointed out and knees slightly bent. Bring your arms to your chest, tucking in your elbows at your side. Keep your neck neutral and maintain a straight back. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor.", "Once you reach your bottom position, powerfully push through your heels to jump upwards.", "As you ascend into the air, rotate 90-degrees to your right.", "Once you land (land on balls of your feet), immediately transition into a subsequent squat and propel yourself upwards, again rotating 90-degrees. Repeat four times (a complete 360-degrees) for one repetition.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122631m.mp4", "name": "90-Degree Jump Squat Twist", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4721/Male/l/4721_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4721/Male/l/4721_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position your legs using a very wide stance with the toes slightly pointed out and knees slightly bent. Rest your hands on your hips. Keep your neck neutral and maintain a straight back. This will be your starting position.", "Descend into a half squat by pushing your hips and butt back. Then push through your heels and jump straight up while simultaneously kicking each leg outward at a 45 degree angle.", "Land back in the starting position and repeat for the recommended amount of repetitions or time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120991m.mp4", "name": "Alien Squat", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4541/Male/l/4541_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4541/Male/l/4541_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start off on your hands and knees, then lift your leg off the floor and hold the foot with your hand.", "Use your hand to hold the foot or ankle, keeping the knee fully flexed, stretching the quadriceps and hip flexors.", "Focus on extending your hips, thrusting them towards the floor. Hold for 10-20 seconds and then switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/58000/59612m.mp4", "name": "All Fours Quad Stretch", "type": "stretching", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/581/Male/l/581_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/581/Male/l/581_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Assume a comfortable stance with one foot slightly in front of the other.", "Begin by pushing off with the front leg, driving the opposite knee forward and as high as possible before landing. Attempt to cover as much distance to each side with each bound.", "It may help to use a line on the ground to guage distance from side to side.", "Repeat the sequence with the other leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94812m.mp4", "name": "Alternate Leg Diagonal Bound", "type": "plyometrics", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/760/Male/l/760_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/760/Male/l/760_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Load a sled with the desired weight, attaching a rope or straps to the sled that you can hold onto.", "Begin the exercise by moving backwards for a given distance. Leaning back, extend through the legs for short steps to move as quickly as possible."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77342m.mp4", "name": "Backward Drag", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/728/Male/l/728_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/728/Male/l/728_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Deadlift a barbell off the ground and clean it to a racked position. If you are using a squat rack set it just below shoulder height and rest a barbell on top of your deltoids, pushing into the clavicles, and lightly touching the throat. Your hands should be in a clean grip, touching the bar only with your fingers to help keep it in position.", "Position your feet into a shoulder-width apart stance with the toes slightly pointed out. Keep your head and elbows up at all times. Your triceps should remain parallel to the ground. Keep a neutral neck and flat back. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor.", "Drive up through your heels, pushing your feet and knees out. Continue upward, maintaining tightness head to toe, until you have returned to the starting position. Then, push upwards by fully extending your arms overhead and move the bar to a back squat position (lying across your upper traps).", "Then, complete a back squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor.", "Drive up through your heels, pushing your feet and knees out. Continue upward, maintaining tightness head to toe, until you have returned to the top position.", "Return the bar to a front squat position by pushing upwards and fully extending your arms and moving the bar back to the top of your deltoids. This is one repetition.", "Repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122761m.mp4", "name": "Barbell Front-To-Back Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5021/Male/l/5021_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5021/Male/l/5021_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just above shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.", "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.", "Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position.", "Begin to slowly lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until your hamstrings are on your calves. Inhale as you perform this portion of the movement.", "Begin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/52000/53801m.mp4", "name": "Barbell Full Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/64/Male/l/64_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/64/Male/l/64_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand up straight while holding a barbell behind you at arms length and your feet at shoulder width. Tip: A shoulder width grip is best with the palms of your hands facing back. You can use wrist wraps for this exercise for a better grip. This will be your starting position.", "While keeping your head and eyes up and back straight, squat until your upper thighs are parallel to the floor. Breathe in as you slowly go down.", "Pressing mainly with the heel of the foot and squeezing the thighs, go back up as you breathe out.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/52000/53811m.mp4", "name": "Barbell Hack Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/84/Male/l/84_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/84/Male/l/84_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.", "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.", "Step away from the rack and step forward with your right leg and squat down through your hips, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: Do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. li>", "Using mainly the heel of your foot, push up and go back to the starting position as you exhale.", "Repeat the movement for the recommended amount of repetitions and then perform with the left leg.", "One way is to alternate each leg. For instance do one repetition with the right, then the left, then the right and so on.", "The other way is to do what I call a static lunge where your starting position is with one of your feet already forward. In this case, you just go up and down from that starting position until you are done with the recommended amount of repetitions. Then you switch legs and do the same.", "A more challenging version is the walking lunges where you walk across the room but in a lunging fashion. For walking lunges the leg being left back has to be brought forward after the lunging action has happened in order to continue moving ahead. This version is reserved for the most advanced athletes."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/38000/38291m.mp4", "name": "Barbell Lunge", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/41/Male/l/41_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/41/Male/l/41_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Position a weighted bar across your upper back holding the ends with your hands to keep it stable. Alternately, you can do this in a squat rack to more easily get into the starting position. Stand erect with your chest out and your shoulders back, maintaining the natural curve in your back and knees unlocked. Your feet should be about hip width apart. This is your starting position.", "Staying erect, initiate the movement by stepping back with one foot about 2 feet, keeping your hips facing forward as the toe of your back foot makes contact first. Then allow both knees to bend and descend just short of allowing your trailing knee to touch the floor.", "Your body should continue to be upright. Don't lean forward or allow you back to round. Press back up by pushing through your back foot maintaining balance as you return to the starting position.", "Repeat on the opposite side, and repeat for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120561m.mp4", "name": "Barbell Reverse Lunge", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4361/Male/l/4361_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4361/Male/l/4361_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck). Your feet should be placed wide apart with the foot of the lead leg angled out to the side. This will be your starting position.", "Lower your body towards the side of your angled foot by bending the knee and hip of your lead leg and while keeping the opposite leg only slightly bent. Breathe in as you lower your body.", "Return to the starting position by extending the hip and knee of the lead leg. Breathe out as you perform this movement.", "After performing the recommended amount of reps, repeat the movement with the opposite leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/24000/25791m.mp4", "name": "Barbell Side Split Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/310/Male/l/310_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/310/Male/l/310_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin with the barbell supported on top of the traps. The chest should be up and the head facing forward. Adopt a hip-width stance with the feet turned out as needed.", "Descend by flexing the knees, refraining from moving the hips back as much as possible. This requires that the knees travel forward. Ensure that they stay align with the feet. The goal is to keep the torso as upright as possible.", "Continue all the way down, keeping the weight on the front of the heel. At the moment the upper legs contact the lower legs reverse the motion, driving the weight upward."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118981m.mp4", "name": "Barbell Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3861/Male/l/3861_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3861/Male/l/3861_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first place a flat bench or a box behind you. The flat bench is used to teach you to set your hips back and to hit depth.", "", "Then, set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.", "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.", "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).", "Begin to slowly lower the bar by bending the knees and sitting your hips back as you maintain a straight posture with the head up. Continue down until you slightly touch the bench behind you. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs and extend the hips to go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/52000/53851m.mp4", "name": "Barbell Squat To A Bench", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/58/Male/l/58_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/58/Male/l/58_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders.", "Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.", "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box", "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/119011m.mp4", "name": "Barbell Squat To A Box", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3871/Male/l/3871_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3871/Male/l/3871_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck) and stand upright behind an elevated platform (such as the one used for spotting behind a flat bench). This is your starting position.", "Place the right foot on the elevated platform. Step on the platform by extending the hip and the knee of your right leg. Use the heel mainly to lift the rest of your body up and place the foot of the left leg on the platform as well. Breathe out as you execute the force required to come up.", "Step down with the left leg by flexing the hip and knee of the right leg as you inhale. Return to the original standing position by placing the right foot of to next to the left foot on the initial position.", "Repeat with the right leg for the recommended amount of repetitions and then perform with the left leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/52000/53861m.mp4", "name": "Barbell Step Ups", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/62/Male/l/62_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/62/Male/l/62_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Set the bar in a rack slightly below shoulder level so that when under it, your knees are slightly bent. Rest the bar on top of the front deltoids, pushing into the clavicles, and lightly touching the throat. Your hands should be in a clean grip, touching the bar only with your fingers to help keep it in position.", "To unrack the bar, push upward into it and push your hips forward. Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head and elbows up at all times. Your triceps should remain parallel with the ground. Keep a neutral neck and flat back. This will be your starting position.", "Descend into a squat by pushing your hips and butt back. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "As you prepare to ascend, push through your heels and begin to wrap your fingers tightly around the bar for a firm grip. As you near the top of your squat, begin pressing the bar up towards the ceiling, allowing your neck to hyperextend so that the bar has room to move.", "A final position will be one in which your arms are fully extended overhead and your legs straight. Maintain tightness from head to toe.", "Lower the bar slowly, allowing your knees to bend to lessen the blow. Immediately transition back into the squatting movement to continue into the next repetition. Repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120291m.mp4", "name": "Barbell Thruster", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4231/Male/l/4231_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4231/Male/l/4231_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet shoulder width apart and a barbell across your upper back.", "Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot.", "Drive through the heel of your lead foot and extend both knees to raise yourself back up.", "Step forward with your rear foot, repeating the lunge on the opposite leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/106000/107032m.mp4", "name": "Barbell Walking Lunge", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2241/Male/l/2241_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2241/Male/l/2241_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Wearing either a harness or a loose weight belt, attach the chain to the back so that you will be facing away from the sled. Bend down so that your hands are on the ground. Your back should be flat and knees bent. This is your starting position.", "Begin by driving with legs, alternating left and right. Use your hands to maintain balance and to help pull. Try to keep your back flat as you move over a given distance."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77272m.mp4", "name": "Bear Crawl Sled Drags", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/730/Male/l/730_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/730/Male/l/730_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin with a box or bench 1-2 feet in front of you. Stand with your feet shoulder width apart. This will be your starting position.", "Perform a short squat in preparation for the jump; swing your arms behind you.", "Rebound out of this position, extending through the hips, knees, and ankles to jump as high as possible. Swing your arms forward and up.", "Jump over the bench, landing with the knees bent, absorbing the impact through the legs.", "Turn around and face the opposite direction, then jump back over the bench."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/104000/104302m.mp4", "name": "Bench Jump", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1891/Male/l/1891_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1891/Male/l/1891_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand on the ground with one foot resting on a bench or box with your heel close to the edge.", "Push off with your foot on top of the bench, extending through the hip and knee.", "Land with the opposite foot on top of the box, returning your other foot back to the start position.", "Continue alternating from one foot to another to complete the set."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/104000/104312m.mp4", "name": "Bench Sprint", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1901/Male/l/1901_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1901/Male/l/1901_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, seat yourself on the bike and adjust the seat to your height."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71742m.mp4", "name": "Bicycling", "type": "cardio", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/646/Male/l/646_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/646/Male/l/646_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, seat yourself on the bike and adjust the seat to your height.", "Select the desired option from the menu. You may have to start pedaling to turn it on. You can use the manual setting, or you can select a program to use. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. The level of resistance can be changed throughout the workout. The handles can be used to monitor your heart rate to help you stay at an appropriate intensity."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71762m.mp4", "name": "Bicycling, Stationary", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/647/Male/l/647_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/647/Male/l/647_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand erect with your feet hip-width apart, chest out, and shoulders back, maintaining the natural curvature of your spine. Your knees should be unlocked and your hand on your hips. This is your starting position.", "Take a moderate-length step forward with one foot, descending to a point in which your rear knee approaches the floor without touching, maintaining your body's upright posture. Your front knee should bend about 90 degrees, but for knee health it should not be forward of the vertical plane that extends straight up from your toes. If so, take a slightly longer step.", "From the bottom position, push back up from your forward foot, bringing it back beside the other.", "Repeat on the opposite side for the required number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120631m.mp4", "name": "Bodyweight Lunge", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4461/Male/l/4461_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4461/Male/l/4461_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position. Your hands should be on your hips or hanging at your sides. Look directly forward, keeping your chest up, with your feet shoulder-width apart. This will be your starting position.", "Initiate the movement by taking a step to the rear, allowing your hips and knees to flex to lower your body. Contacting the back leg through only the ball of the foot, descend until your knee nearly touches the ground. Use a slow and controlled motion, paying special attention to proper mechanics and posture. The knee should stay in line with the foot, and the thoracic spine should remain neutral.", "After a brief pause, return to the starting position by driving through the heel of the front leg to extend the knees and hips.", "This movement can be done completely on one side before switching, or can be performed in an alternating fashion."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120091m.mp4", "name": "Bodyweight Reverse Lunge", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4051/Male/l/4051_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4051/Male/l/4051_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand with your feet shoulder width apart. You can place your hands behind your head. This will be your starting position.", "Begin the movement by flexing your knees and hips, sitting back with your hips.", "Continue down to full depth if you are able,and quickly reverse the motion until you return to the starting position. As you squat, keep your head and chest up and push your knees out."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/90572m.mp4", "name": "Bodyweight Squat", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/855/Male/l/855_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/855/Male/l/855_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet shoulder width apart and your hands on your hips.", "Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot.", "Drive through the heel of your lead foot and extend both knees to raise yourself back up.", "Step forward with your rear foot, repeating the lunge on the opposite leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/106000/106952m.mp4", "name": "Bodyweight Walking Lunge", "type": "strength", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2161/Male/l/2161_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2161/Male/l/2161_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand on the flat side of a Bosu ball, with a shoulder-width stance. Maintain good spinal position with your chest up and head looking forward. This will be your starting position.", "Flex the knees and hips to lower your body, keeping your knees aligned with your feet and hips. Squat as deep as flexibility allows. Do not allow your knees to cave or allow your thoracic spine to flex.", "Pause at the bottom of the motion, and then return to the starting position by extending at the knees and hips."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117701m.mp4", "name": "Bosu Ball Squat", "type": "strength", "equipment": "exerciseball", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3431/Male/l/3431_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3431/Male/l/3431_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["The box squat allows you to squat to desired depth and develop explosive strength in the squat movement. Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.", "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.", "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76682m.mp4", "name": "Box Squat", "type": "powerlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/665/Male/l/665_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/665/Male/l/665_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in a power rack with a box at the appropriate height behind you. Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension. If dumbbells are used, secure them so that they don't move. Also, ensure that the dumbbells you are using are heavy enough for the bands that you are using. Additional plates can be used to hold the dumbbells down. If more tension is needed, you can either widen the base on the floor or choke the bands. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.", "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.", "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76702m.mp4", "name": "Box Squat with Bands", "type": "powerlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/666/Male/l/666_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/666/Male/l/666_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.", "To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.", "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.", "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78452m.mp4", "name": "Box Squat with Chains", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/667/Male/l/667_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/667/Male/l/667_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin standing with your legs shoulder-width apart.", "Place your hands on the floor and kick your legs back so you end up with your stomach and thighs on the floor. Your elbows should be bent.", "From this position, press up like you're doing a push-up and push your hips up.", "Jump your feet under your hips and stand.", "Finish the movement by jumping in the air and bringing your hands over your head.", "Repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118171m.mp4", "name": "Burpee", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3153/Male/l/3153_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3153/Male/l/3153_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Place a box or platform approximately an armâ€™s length away. Stand facing the box with your legs shoulder-width apart. This will be your starting position.", "Place your hands on the floor and quickly kick your legs back so you end up with your stomach and thighs on the floor and elbows bent.", "From this position, press up like you're doing a push-up, and push your hips up. Jump your feet under your hips and begin to stand as you prepare to jump up.", "As you jump, jump forward so that you land on the box in front of you. This is one repetition.", "Quickly but gently step down from the box and repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123212m.mp4", "name": "Burpee Box Jump", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5493/Male/l/5493_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5493/Male/l/5493_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Place a loaded barbell on the floor and stand parallel to the bar with your legs shoulder-width apart. This will be your starting position.", "Place your hands on the floor and kick your legs back so you end up with your stomach and thighs on the floor. Your elbows should be bent. This should be done quickly.", "From this position, press up like you're doing a push-up and push your hips up. Jump your feet under your hips and begin to stand as you prepare to jump up.", "As you jump, jump laterally (to the left or right) so that you land on the other side of the bar. This is one repetition.", "Repeat steps 2 to 4 and return to the other side of the bar. Repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120271m.mp4", "name": "Burpee Over Barbell", "type": "plyometrics", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4221/Male/l/4221_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4221/Male/l/4221_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet hip-width apart. This will be your starting position.", "Place your hands on the floor and kick your legs back so you end up with your stomach and thighs on the floor. Your elbows should be bent. From this position, press up like you're doing a push-up, extending your arms and bringing your hips off the ground.", "Jump your feet under your hips into a squat position, then immediately explode upward, driving your knees towards your chest.", "Jump as high as you can, raising your knees up, and then ensure a good landing by extending your legs and absorbing the impact by bending your knees.", "Repeat for the recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123062m.mp4", "name": "Burpee Tuck Jump", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5213/Male/l/5213_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5213/Male/l/5213_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Place a box or platform approximately an armâ€™s length away. Stand facing the box with your legs shoulder-width apart. This will be your starting position.", "Place your hands on the floor and quickly kick your legs back so you end up with your stomach and thighs on the floor and elbows bent.", "From this position, press up like you're doing a push-up, and push your hips up. Jump your feet under your hips and begin to stand as you prepare to jump up.", "As you jump, jump forward so that you land on the box in front of you. This is one repetition.", "Quickly but gently step down from the box and repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123212m.mp4", "name": "Burppe Box Jump", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5423/Male/l/5423_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5423/Male/l/5423_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand with your legs shoulder-width apart. Your arms should be bent at your sides.", "Flex the right knee and kick your right heel up toward your glutes. Bring the right foot back down.", "As the right leg comes down, flex your left knee and kick your left foot up toward your glutes. Swing your arms as if you were jogging.", "Repeat"], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118181m.mp4", "name": "Butt Kicks", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3143/Male/l/3143_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3143/Male/l/3143_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Move the cables to the bottom of the towers and select an appropriate weight. Stand directly in between the uprights.", "To begin, squat down be flexing your hips and knees until you can reach the handles.", "After grasping them, begin your ascent. Driving through your heels extend your hips and knees keeping your hands hanging at your side. Keep your head and chest up throughout the movement.", "After reaching a full standing position, Return to the starting position and repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94012m.mp4", "name": "Cable Deadlifts", "type": "strength", "equipment": "cable", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/860/Male/l/860_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/860/Male/l/860_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand in front of a low pulley facing forward with one leg next to the pulley and the other one away.", "Attach the ankle cuff to the cable and also to the ankle of the leg that is next to the pulley.", "Now step out and away from the stack with a wide stance and grasp the bar of the pulley system.", "Stand on the foot that does not have the ankle cuff (the far foot) and allow the leg with the cuff to be pulled towards the low pulley. This will be your starting position.", "Now perform the movement by moving the leg with the ankle cuff in front of the far leg by using the inner thighs to abduct the hip. Breathe out during this portion of the movement.", "Slowly return to the starting position as you breathe in.", "Repeat for the recommended amount of repetitions and then repeat the same movement with the opposite leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/52000/53921m.mp4", "name": "Cable Hip Adduction", "type": "strength", "equipment": "cable", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/312/Male/l/312_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/312/Male/l/312_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["This event apparatus typically has neutral grip handles, however some have a straight bar that you can approach like a normal deadlift. The apparatus can be loaded with a vehicle or other heavy objects such as tractor tires or kegs.", "Center yourself between the handles if you are a strong squatter, or back a couple inches if you are a strong deadlifter. You feet should be about hip width apart. Bend at the hip to grip the handles. With your feet and your grip set, take a big breath and then lower your hips and flex the knees.", "Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. As the weight comes up, pull your shoulder blades together as you drive your hips forward.", "Lower the weight by bending at the hips and guiding it to the floor."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77072m.mp4", "name": "Car Deadlift", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/676/Male/l/676_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/676/Male/l/676_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, first set the bar to a position that best matches your height. Once the bar is loaded, step under it and position it across the back of your shoulders.", "Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs.", "Move your feet forward about 18 inches in front of the bar. Position your legs using a shoulder width stance with the toes slightly pointed out. Look forward at all times and maintain a neutral or slightly arched spine. This will be your starting position.", "Slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper and lower leg breaks 90 degrees.", "Begin to raise the bar as you exhale by pushing the floor with the heels of your feet, extending the knees and returning to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/104000/104322m.mp4", "name": "Chair Squat", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1821/Male/l/1821_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1821/Male/l/1821_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["With a barbell on boxes or stands of the desired height, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.", "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight with the elbows pointed out.", "As full extension is achieved, transition into the receiving position by aggressively shrugging and flexing the arms with the elbows up and out. Aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.", "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position. Return the weight to the boxes for the next rep."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76952m.mp4", "name": "Clean from Blocks", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/746/Male/l/746_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/746/Male/l/746_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["With a barbell on the floor close to the shins, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.", "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight and elbows out. Move the weight with control as you continue to above the knees.", "Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended. Full extension should be violent and abrupt, and ensure that you do not prolong the extension for longer than necessary."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76792m.mp4", "name": "Clean Pull", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/672/Male/l/672_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/672/Male/l/672_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Position your legs using a very narrow stance (feet a few inches apart) with the toes slightly pointed out and knees slightly bent. Hold a dumbbell (hand on each end) at chest level, with your elbows tucked inwards to your side. Keep your neck neutral and maintain a straight back. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "Once you reach your bottom position, begin to push through your heels to ascend upwards and return to the starting position.", "Repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122671m.mp4", "name": "Close-Stance Dumbbell Front Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4771/Male/l/4771_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4771/Male/l/4771_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["With the weight loaded, take a zurcher hold on the end of the implement. Place the bar in the crook of the elbow and hold onto your wrist. Try to keep the weight off of the forearms.", "Begin by lifting the weight from the ground. Keep a tight, upright posture as you being to walk, taking short, fast steps. Look up and away as you turn in a circle. Do not hold your breath during the event. Continue walking until you complete one or more complete turns."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76832m.mp4", "name": "Conan's Wheel", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/674/Male/l/674_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/674/Male/l/674_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in an athletic position with your knees bent and your chest up. Your arms should be in front of your body.", "Shuffle laterally to the right by stepping sideways with your right foot and bringing the left to match.", "As the left foot meets your right, shuffle sideways again.", "Once you've taken 2-3 shuffles, change direction and move to the left.", "Repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118221m.mp4", "name": "Defensive Slide", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3093/Male/l/3093_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3093/Male/l/3093_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["For this drill you will need two boxes or benches, one 12 to 16 inches high and the other 22 to 26 inches high.", "Stand on one of the two boxes with arms at the sides; feet should be together and slightly off the edge as in the depth jump. Place the other box approximately two or three feet in front of and facing the performer.", "Begin by dropping off the initial box, landing and simultaneously taking off with both feet.", "Rebound by driving upward and outward as intensely as possible, using the arms and full extension of the body to jump onto the higher box. Again, allow the legs to absorb the impact."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91402m.mp4", "name": "Depth Jump Leap", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/775/Male/l/775_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/775/Male/l/775_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin standing with your knees slightly bent.", "Quickly squat a short distance, flexing the hips and knees, and immediately extend to jump for maximum vertical height.", "As you go up, tuck your heels by flexing the knees, attempting to touch the buttocks.", "Finish the motion by landing with the knees only partially bent, using your legs to absorb the impact."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94832m.mp4", "name": "Double Leg Butt Kick", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/778/Male/l/778_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/778/Male/l/778_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["From a standing position, grasp a rope handle in each hand and place your feet in front of the jump rope, so the rope rests on the ground behind your heels. Hold your arms down at arm's length, tucking your elbows into your sides and bring your hands up so your forearms are parallel to the ground. This will be your starting position.", "Begin the exercise by swinging the rope up and over your head, utilizing wrist and shoulder rotation; jump as the rope approaches your feet.", "Every third rotation, jump a little higher and whip the wrists as fast as you can, causing the rope to pass under you twice before the jump is complete."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120831m.mp4", "name": "Double Under", "type": "cardio", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5043/Male/l/5043_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5043/Male/l/5043_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.", "Step forward with your right leg around 2 feet or so, flexing your knees to drop your hips. Keep your torso upright to help maintain balance. Do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground.", "Using mainly the heel of your foot, push up and go back to the starting position.", "Repeat the movement, this time stepping forward with your left leg.", "Repeat the movement for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/121181m.mp4", "name": "Dumbbell Alternating Lunge", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5073/Male/l/5073_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5073/Male/l/5073_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand with your feet slightly wider than hip-width apart, holding a pair of light dumbbells down by your sides. Clean the dumbbells up to your shoulders so that one end of each dumbbell rests on top of each shoulder. Balance the dumbbells on your shoulder by holding on to dumbbells with elbows facing forward. This will be your starting position.", "Keeping your head facing forward, your back straight, and your chest high, squat down by bending your hips back while allowing knees to come forward slightly, keeping your back straight and knees pointed in the same direction as your feet. Descend until your thighs are at parallel, or just past parallel to floor.", "To return to the starting position, extend your knees and hips until your legs are straight. Repeat for the recommended number of reps."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122731m.mp4", "name": "Dumbbell Front Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4831/Male/l/4831_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4831/Male/l/4831_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["From a standing position cradle the head of a dumbbell close to your chest with both hands. You should be looking straight forward, with your shoulders back, your spine straight, and your feet just outside of shoulder width. This will be your starting position.", "Initiate the movement by descending into a squat, flexing the hips and knees to lower your body. Maintain the angle of your torso, paying close attention to the preservation of your spine. As you descend, push your knees outward and keep your weight on your heels.", "Descend until you either reach the full squat position with your hamstrings on your calves or until your back starts to round. At the bottom of the motion pause briefly.", "Return to the starting position by driving through your heels, extending the knees and hips to return to the starting position. Repeat the movement for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/119391m.mp4", "name": "Dumbbell Goblet Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3711/Male/l/3711_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3711/Male/l/3711_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position your feet into a slightly wider-than-shoulder-width stance with your toes slightly pointed out and knees slightly bent. Grasp a dumbbell in each hand and let your arms hang down by your sides with your palms facing your thighs (neutral grip). Keep your neck neutral and maintain a straight back. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor.", "Once you reach your bottom position, powerfully push through your heels to jump upwards, making sure to keep your arms fully extended by your side.", "Once you land (land on the balls of your feet), you've completed one repetition. Immediately propel yourself upwards into a second repetition.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122661m.mp4", "name": "Dumbbell Jump Squat", "type": "plyometrics", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4761/Male/l/4761_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4761/Male/l/4761_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet shoulder width apart and a dumbbell in each hand. Palms should be facing your thighs (neutral grip). This will be your starting position.", "Step forward with your right leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot.", "As you step forward, also begin to flex at the elbow, curling the dumbbells (in both hands) upwards towards the front deltoids. Your wrists should rotate so that your palms are facing upwards as you complete the curl.", "Push off of your front leg and return to the starting position. Simultaneously lower the dumbbells by extending your arms downwards to the starting position.", "Repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122641m.mp4", "name": "Dumbbell Lunge and Curl", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4731/Male/l/4731_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4731/Male/l/4731_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.", "Step forward with your right leg around 2 feet or so from the foot being left stationary behind and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground.", "Using mainly the heel of your foot, push up and go back to the starting position as you exhale.", "Repeat the movement for the recommended amount of repetitions and then perform with the left leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/52000/53981m.mp4", "name": "Dumbbell Lunges", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/32/Male/l/32_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/32/Male/l/32_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["From a standing position, press a pair of dumbbells overhead by extending the elbows and flexing the shoulders. You should be looking directly forward, with your chest up, knees and hips slightly bent, and your back straight. This will be your starting position.", "Descend into a squat by flexing your hips and knees. As you squat, keep your weight on your heels and push your knees out. Maintain proper curvature of your entire spine, from the lower back all the way up through your cervical spine.", "Descend as far as your flexibility allows or until you have reached a full squat position. Avoid excessive forward lean, rounding your lumbar or thoracic spine, and keep the dumbbell in place throughout the exercise.", "After a brief pause, return to the starting position by extending through the hips and knees. Repeat for the desired number of repetitions"], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/119451m.mp4", "name": "Dumbbell Overhead Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3771/Male/l/3771_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3771/Male/l/3771_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["From a standing position, hold an upright dumbbell in both hands close to your chest. Raise one foot an inch or two off the floor. You should be looking directly forward, with your chest up, knees and hips slightly bent, and your back straight. This will be your starting position.", "Descend into a squat by flexing your hips and knee. As you squat, extend the non-working leg forward to allow clearance for your movement. Descend slowly, paying close attention to balance and proper movement mechanics, going as far as your flexibility allows.", "Hold the bottom position briefly and then return to the start by extending through the hips and knee, driving through the heel of your working foot.", "Repeat for the desired number of repetitions, then switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120821m.mp4", "name": "Dumbbell Pistol Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5053/Male/l/5053_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5053/Male/l/5053_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.", "Step backward with your right leg around two feet or so from the left foot and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Tip: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground. Keep the torso upright during the lunge; flexible hip flexors are important. A long lunge emphasizes the Gluteus Maximus; a short lunge emphasizes Quadriceps.", "Push up and go back to the starting position as you exhale. Tip: Use the ball of your feet to push in order to accentuate the quadriceps. To focus on the glutes, press with your heels.", "Now repeat with the opposite leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/38000/39111m.mp4", "name": "Dumbbell Rear Lunge", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/109/Male/l/109_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/109/Male/l/109_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Position a box a couple feet to the side of a bench. Hold a dumbbell to your chest with both hands and seat yourself on the bench facing the box. This will be your starting position.", "Plant your feet firmly on the ground as you lean forward, extending through the hips and knees to jump up and forward.", "Land on the box with both feet, absorbing the impact by allowing the hips and knees to bend.", "Step down and return to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99212m.mp4", "name": "Dumbbell Seated Box Jump", "type": "plyometrics", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1151/Male/l/1151_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1151/Male/l/1151_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand up straight while holding a dumbbell on each hand (palms facing the side of your legs).", "Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section.", "Begin to slowly lower your torso by bending the knees as you maintain a straight posture with the head up. Continue down until your thighs are parallel to the floor. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise your torso as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/38000/39161m.mp4", "name": "Dumbbell Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/85/Male/l/85_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/85/Male/l/85_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start with your feet shoulder-width apart and toes pointing outward slightly. Position a dumbbell in front of your thigh with your knuckles facing forward. This will be your starting position.", "Squat down by bending at your knees and lower the dumbbell between your knees, keeping your arm straight and your shoulder over the dumbbell. Pull the dumbbell up by extending the hips and knees. Shrug your shoulders and pull the dumbbell upward with your arm, allowing your elbow to pull up to the side.", "Aggressively pull your body under the dumbbell, catching the dumbbell with your arm extended overhead while moving into a squat position. The crease of your hips should be lower than the height of your knees. The movement is completed by standing up to full hip and knee extension with the weight held overhead. Bring the dumbbell back down to the starting position. This is one rep.", "Complete for the recommended number of repetitions before switching sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123232m.mp4", "name": "Dumbbell Squat Snatch", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5433/Male/l/5433_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5433/Male/l/5433_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Stand up straight with a flat bench behind you while holding a dumbbell on each hand (palms facing the side of your legs).", "Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section.", "Begin to slowly lower your torso by bending the knees as you maintain a straight posture with the head up. Continue down until you slightly touch the bench behind you. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54031m.mp4", "name": "Dumbbell Squat To A Bench", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/61/Male/l/61_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/61/Male/l/61_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand up straight while holding a dumbbell on each hand (palms facing the side of your legs).", "Place the right foot on the elevated platform. Step on the platform by extending the hip and the knee of your right leg. Use the heel mainly to lift the rest of your body up and place the foot of the left leg on the platform as well. Breathe out as you execute the force required to come up.", "Step down with the left leg by flexing the hip and knee of the right leg as you inhale. Return to the original standing position by placing the right foot of to next to the left foot on the initial position.", "Repeat with the right leg for the recommended amount of repetitions and then perform with the left leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/38000/39171m.mp4", "name": "Dumbbell Step Ups", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/63/Male/l/63_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/63/Male/l/63_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet about hip-width apart and holding dumbbells in your hands down by your side. This will be your starting position.", "Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should be in line with your front foot. Do not allow your front knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint.", "Drive through the heel of your lead foot and extend both knees to raise yourself back up.", "Step forward with your rear foot, repeating the lunge on the opposite leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/121091m.mp4", "name": "Dumbbell Walking Lunge", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4581/Male/l/4581_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4581/Male/l/4581_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position a bar onto a rack at shoulder height loaded to an appropriate weight. Place a short, raised platform behind you.", "Rack the bar onto your upper back, keeping your back arched and tight. Step onto your raised platform with both feet. This will be your starting position.", "Begin by stepping backwards with one leg. Descend by flexing your hips and knees until your knee touches the floor.", "Pause, and extend through the hips and knees to rise up, returning all the way to the starting position before alternating."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99182m.mp4", "name": "Elevated Back Lunge", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1171/Male/l/1171_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1171/Male/l/1171_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, step onto the elliptical and select the desired option from the menu. Most ellipticals have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.", "The handles can be used to monitor your heart rate to help you stay at an appropriate intensity."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71772m.mp4", "name": "Elliptical Trainer", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/648/Male/l/648_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/648/Male/l/648_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Start with your feet hip-width apart and arms straight out by your side. Your arms should be parallel to the floor with palms facing down. This is your starting position.", "Start to make small, forward circles with each arm, at the same time. As you're doing this, kick your right foot forward, and then quickly alternate by bringing your right foot back down and your left foot forward.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118231m.mp4", "name": "Fast Kick With Arm Circles", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2983/Male/l/2983_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2983/Male/l/2983_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start in a relaxed position with one leg slightly forward. This will be your starting position.", "Skip by executing a step-hop pattern of right-right-step to left-left-step, and so on, alternating back and forth.", "Perform fast skips by maintaining close contact with the ground and reduce air time, moving as quickly as possible."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94862m.mp4", "name": "Fast Skipping", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/780/Male/l/780_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/780/Male/l/780_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start with your feet together, arms bent, and elbows at your side.", "At the same time, jump both feet out to the side, allowing your elbows to swing out slightly.", "Immediately reverse the motion by jumping back to the starting position and bringing your elbows back into your side.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118241m.mp4", "name": "Feet Jack", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2973/Male/l/2973_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2973/Male/l/2973_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start with your feet shoulder-width apart and arms bent at your sides.", "Begin to quickly move your feet, as if you were running in place, while keeping your hands in front of you. Maintain this intensity for 5 seconds.", "Next, drop down to the floor in a push up position, letting your abdomen come in contact with the floor. Quickly push up with your arms and bring your feet towards your body to get back up to the starting position.", "Repeat for the recommended amount of repetitions or time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118251m.mp4", "name": "Football Up-Down", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2993/Male/l/2993_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2993/Male/l/2993_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Position a band around your lower legs. The resistance can be applied closer to the knees for an easier movement or around the ankles or feet for a more advanced movement.", "With the band in place, assume an athletic standing position, with the knees and hips slightly bent, feet shoulder-width apart, and the head and chest up. This is your starting position.", "Staying low, take a slow, lengthy forward step. After completing the movement, follow with the opposite leg, stepping in front of the lead foot. Step slowly, resisting the band. Keep the feet shoulder-width apart to maintain band tension.", "Continue to step forward in this manner to complete the set for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118491m.mp4", "name": "Forward Band Walk", "type": "strength", "equipment": "bands", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3731/Male/l/3731_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3731/Male/l/3731_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["This drill teaches you the proper positioning of both the bar and your body during the clean and front squat.", "Place the barbell on the front of the shoulders, releasing your grip and extending your arms out in front of you. The shoulders should be pushed forward to create a shelf, and the bar should be in contact with the throat. Ensure that you only move your shoulder blades forward; don't round the thoracic spine.", "Squat by flexing the knees and hips, sitting in between your legs. Keep the torso upright, the arms up, and the shoulders forward, and the bar should stay in place. Go to the bottom of the squat, until your hamstrings contact your calves.", "Return to the upright position by driving through the front of the heel and extending the knees and hips."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77382m.mp4", "name": "Frankenstein Squat", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/684/Male/l/684_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/684/Male/l/684_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Cross your arms over your chest.", "With your head up and your back straight, position your feet at shoulder width.", "Keeping your back straight and chest up, squat down as you inhale until your upper thighs are parallel, or lower, to the floor.", "Now pressing mainly with the ball of your feet, jump straight up in the air as high as possible, using the thighs like springs. Exhale during this portion of the movement.", "When you touch the floor again, immediately squat down and jump again.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54071m.mp4", "name": "Freehand Jump Squat", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/108/Male/l/108_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/108/Male/l/108_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand with your hands behind your head, and squat down keeping your torso upright and your head up. This will be your starting position.", "Jump forward several feet, avoiding jumping unnecessarily high. As your feet contact the ground, absorb the impact through your legs, and jump again. Repeat this action 5-10 times."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/58000/59872m.mp4", "name": "Frog Hops", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/588/Male/l/588_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/588/Male/l/588_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.", "Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.", "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).", "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor mainly with the middle of your foot as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54081m.mp4", "name": "Front Barbell Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/42/Male/l/42_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/42/Male/l/42_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first set a flat bench behind you and set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.", "Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.", "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).", "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until you touch the bench with your glutes. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor mainly with the heel of your foot as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54091m.mp4", "name": "Front Barbell Squat To A Bench", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/59/Male/l/59_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/59/Male/l/59_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Set up a row of cones or other small barriers, placing them a few feet apart.", "Stand in front of the first cone with your feet shoulder width apart. This will be your starting position.", "Begin by jumping with both feet over the first cone, swinging both arms as you jump.", "Absorb the impact of landing by bending the knees, rebounding out of the first leap by jumping over the next cone.", "Continue until you have jumped over all of the cones."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91522m.mp4", "name": "Front Cone Hops (or hurdle hops)", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/783/Male/l/783_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/783/Male/l/783_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Set the bar in a rack slightly below shoulder level so that when under it, your knees are slightly bent. Rest the bar on top of the deltoids, pushing into the clavicles, and lightly touching the throat.", "Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.", "Push upward into the bar and push your hips forward to unrack. Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head and elbows up at all times. Keep a neutral neck and flat back. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "Drive up through your heels, pushing your feet and knees out. Continue upward, maintaining tightness head to toe, until you have returned to the starting position. Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120871m.mp4", "name": "Front Squat (Bodybuilder)", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4481/Male/l/4481_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4481/Male/l/4481_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Set the bar in a rack slightly below shoulder level so that when under it, your knees are slightly bent. Rest the bar on top of the deltoids, pushing into the clavicles, and lightly touching the throat. Your hands should be in a clean grip, touching the bar only with your fingers to help keep it in position.", "Push upward into the bar and push your hips forward to unrack. Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head and elbows up at all times. Your triceps should remain parallel with the ground. Keep a neutral neck and flat back. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "Drive up through your heels, pushing your feet and knees out. Continue upward, maintaining tightness head to toe, until you have returned to the starting position. Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120891m.mp4", "name": "Front Squat (Clean Grip)", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4491/Male/l/4491_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4491/Male/l/4491_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Set the bar in a rack slightly below shoulder level so that when under it, your knees are slightly bent. Rest the bar on top of the deltoids, pushing into the clavicles, and lightly touching the throat. Your hands should be in a clean grip, touching the bar only with your fingers to help keep it in position.", "Push upward into the bar and push your hips forward to unrack. Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head and elbows up at all times. Your triceps should remain parallel with the ground. Keep a neutral neck and flat back. This will be your starting position.", "Descend into a squat by pushing your hips and butt back. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "As you prepare to ascend, push through your heels and begin to wrap your fingers tightly around the bar for a firm grip.", "Begin pressing the bar up towards the ceiling as you begin squatting upwards, allowing your neck to hyperextend so that the bar has room to move. A final position will be one in which your arms are fully extended overhead and knees slightly bent, maintaining tight ness from head to toe.", "Lower the bar slowly to the starting position, allowing your knees to bend slightly to lessen the blow. Repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120851m.mp4", "name": "Front Squat Push Press", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4471/Male/l/4471_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4471/Male/l/4471_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so.", "Looking straight ahead at all times, squat as low as you can and pause at the bottom. As you squat down, push your knees out. You should squat between your legs, keeping an upright torso, with your head and chest up.", "Rise back up by driving through your heels and repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/62000/62962m.mp4", "name": "Front Squats With Two Kettlebells", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/511/Male/l/511_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/511/Male/l/511_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This variation is a 1:1 ratio of a front squat right to into a back squat using a belt.", "To step up for the front squat, place your pinkies on the ring of the barbell with your thumbs off of the smooth part. Bring your arms up under the bar while keeping your elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids.", "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position.", "This variation is a 1:1 ratio of a front squat right to into a back squat using a belt.", "Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement.", "Begin to raise the bar as you exhale by pushing the floor mainly with the middle of your foot as you straighten the legs again and go back to the starting position. Perform the front squat for the recommended number of repetitions, rack the bar, and immediately set up for the back squat.", "Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position.", "Begin to lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees. Inhale as you perform this portion of the movement.", "Begin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position. Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117152m.mp4", "name": "Front-To-Back Squat With Belt", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3243/Male/l/3243_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3243/Male/l/3243_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand holding a light kettlebell by the horns close to your chest. This will be your starting position.", "Squat down between your legs until your hamstrings are on your calves. Keep your chest and head up and your back straight.", "At the bottom position, pause and use your elbows to push your knees out. Return to the starting position, and repeat for 10-20 repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/62000/63912m.mp4", "name": "Goblet Squat", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/590/Male/l/590_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/590/Male/l/590_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your chest up and your feet hip-width apart. This will be your starting position.", "Jump into a lunge position, bringing one foot forward and one foot back, bending both knees to 90 degrees. Ensure that the front knee is over the midline of the foot and the back knee is nearly touching the ground.", "Extend through both legs, jumping as high as possible. As you jump up, switch positions of your legs, moving your front foot to the back, and your rear leg to the front. As you land, absorb the impact through the legs by adopting the lunge position.", "Once again, extend through both legs, jumping as high as possible, but this time youâ€™re going to land with your feet should-width apart in a squat position. This is one repetition.", "Complete for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123032m.mp4", "name": "Gorilla Squat", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5393/Male/l/5393_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5393/Male/l/5393_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Place the back of your torso against the back pad of the machine and hook your shoulders under the shoulder pads provided.", "Position your legs in the platform using a shoulder width medium stance with the toes slightly pointed out. Tip: Keep your head up at all times and also maintain the back on the pad at all times.", "Place your arms on the side handles of the machine and disengage the safety bars (which on most designs is done by moving the side handles from a facing front position to a diagonal position).", "Now straighten your legs without locking the knees. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).", "Begin to slowly lower the unit by bending the knees as you maintain a straight posture with the head up (back on the pad at all times). Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the unit as you exhale by pushing the floor with mainly with the heel of your foot as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/40001m.mp4", "name": "Hack Squat", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/56/Male/l/56_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/56/Male/l/56_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin with a shoulder width, double overhand or hook grip, with the bar hanging at the mid thigh position. Your back should be straight and inclined slightly forward.", "Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears.", "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77532m.mp4", "name": "Hang Clean", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/688/Male/l/688_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/688/Male/l/688_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin with a shoulder width, double overhand or hook grip, with the bar hanging just below the knees. Your back should be straight and inclined slightly forward.", "Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears. As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out.", "At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.", "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77562m.mp4", "name": "Hang Clean - Below the Knees", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/689/Male/l/689_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/689/Male/l/689_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This drill helps you learn the snatch. Begin by holding a light weight across the back of the shoulders. Your feet should be slightly wider than hip width apart with the feet turned out, the same position that you would perform a squat with.", "Begin by dipping with the knees slightly, and popping back up to briefly unload the bar. Drive yourself underneath the bar, elevating it overhead as you descend into a full squat.", "Return to a standing position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77672m.mp4", "name": "Heaving Snatch Balance", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/693/Male/l/693_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/693/Male/l/693_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in an athletic position with your knees bent, your feet shoulder-width apart, and your arms bent and at your sides.", "Flex the hip and bring your right knee up toward your belly button.", "As the right leg comes down, bring the left knee up.", "Alternate lifting the knees high as you jog in place."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118141m.mp4", "name": "High Knee Jog", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3183/Male/l/3183_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3183/Male/l/3183_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Secure one end of the band to the lower portion of a post and attach the other to one ankle.", "Face away from the attachment point of the band.", "Keeping your head and your chest up, raise your knee up to 90 degrees and pause.", "Return the leg to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/95201m.mp4", "name": "Hip Flexion with Band", "type": "strength", "equipment": "bands", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/878/Male/l/878_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/878/Male/l/878_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your feet shoulder-width apart. You should be looking directly forward, with your chest up, knees and hips unlocked, and your back straight. This will be your starting position.", "Begin the exercise by jumping to the right with a slight bend in your knees.", "Next, in the same motion, reach down and toward the outside of your right foot with your left hand. Perform this same movement on the opposite side.", "Repeat this movement for the desired number of reps."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120021m.mp4", "name": "Ice Skater", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4081/Male/l/4081_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4081/Male/l/4081_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Lie face down on the floor, with a rope, belt, or band looped around one foot.", "Flex the knee and extend the hip of the leg to be stretched, using both hands to pull on the belt. Your knee and your hip should come off of the floor, creating tension in the hip flexors and quadriceps. Hold the stretch for 10-20 seconds, and repeat on the other leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/58000/59992m.mp4", "name": "Intermediate Hip Flexor and Quad Stretch", "type": "stretching", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/596/Male/l/596_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/596/Male/l/596_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Lie face down on the floor, with your arms extended out to your side, palms pressed to the floor. This will be your starting position.", "To begin, flex one knee and bring that leg across the back of your body, attempting to touch it to the ground near the opposite hand.", "Promptly return the leg to the starting postion, and quickly repeat with the other leg. Continue alternating for 10-20 repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60002m.mp4", "name": "Iron Crosses (stretch)", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/597/Male/l/597_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/597/Male/l/597_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Place a barbell on the floor.", "Stand in the middle of the bar length wise.", "Bend down by bending at the knees and keeping your back straight and grasp the front of the bar with your right hand. Your palm should be in (neutral grip) facing the left side.", "Grasp the rear of the bar with your left hand. The palm of your hand should be in neutral grip alignment (palms facing the right side). Tip: Ensure that your grip is even on the bar. Your torso should be positioned right in the middle of the bar and the distance between your torso and your right hand (which should be at the front) should be the same as the distance between your torso and your left hand (which should be to your back).", "Now stand straight up with the weight. Tip: Your feet should be shoulder width apart and your toes slightly pointed out.", "Squat down by bending at the knees and keeping your back straight until your upper thighs are parallel with the floor. Tip: Keep your back as vertical as possible with the floor and your head up. Also remember to not let your knees go past your toes. Inhale during this portion of the movement.", "Now drive yourself back up to the starting position by pushing with the feet . Tip: Keep the bar hanging at arm's length and your elbows locked with a slight bend. The arms only serve as hooks. Avoid doing any lifting with them. Do the lifting with your thighs; not your arms."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/40421m.mp4", "name": "Jefferson Squats", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/283/Male/l/283_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/283/Male/l/283_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This movement strengthens the dip portion of the jerk. Begin with the bar racked in the jerk position, with the shoulders forward to create a shelf and the bar lightly contacting the throat. The feet should be directly under the hips, with the feet turned out as is comfortable.", "Keeping the torso vertical, dip by flexing the knees, allowing them to travel forward and without moving the hips to the rear. The dip should not be excessive. Return the weight to the starting position by driving forcefully though the feet."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78032m.mp4", "name": "Jerk Dip Squat", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/695/Male/l/695_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/695/Male/l/695_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet shoulder-width apart. Your arms should be bent and at your sides.", "Lift your right knee up until it reaches your waist. Your left arm should swing forward while your right arm swings back. Keep your left knee slightly bent and allow it to spring.", "Return your right foot to the ground as you lift your left knee. Swing your right arm forward and your left arm back. Keep your right knee slightly bent and allow it to spring. Try to keep your weight on your toes as you alternate through the movement."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118271m.mp4", "name": "Jog In Place", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2963/Male/l/2963_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2963/Male/l/2963_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.", "Treadmills offer convenience, cardiovascular benefits, and usually have less impact than jogging outside. A 150 lb person will burn almost 250 calories jogging for 30 minutes, compared to more than 450 calories running. Maintain proper posture as you jog, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71792m.mp4", "name": "Jogging-Treadmill", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/649/Male/l/649_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/649/Male/l/649_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start in a lunge position with one foot forward and the knee bent, with the rear knee nearly touching the ground.", "Ensure the front knee is over the midline of the foot. Extending through both legs, jump as high as possible, swinging your arms to gain lift.", "As you jump up, switch the position of your legs, moving your front foot to the back and the rear leg to the front. As you land, absorb the impact through the legs by adopting the lunge position, and repeat for a total of 4 repetitions.", "After 4 repetition, complete 2 feet jacks. Start with your feet together, arms bent, and elbows at your side.", "At the same time, jump both feet out to the side, allowing your elbows to swing out slightly. Immediately reverse the motion by jumping back to the starting position and bringing your elbows back into your side.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118281m.mp4", "name": "Jump Lunge To Feet Jack", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3003/Male/l/3003_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3003/Male/l/3003_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Start with your arms by your side, feet shoulder width apart, head up, and back straight.", "Keeping your back straight and chest up, squat down as you inhale until your upper thighs are parallel, or lower, to the floor.", "Now pressing mainly with the balls of your feet, jump straight up in the air as high as possible, using the thighs like springs. Exhale during this portion of the movement."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118291m.mp4", "name": "Jump Squat", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2953/Male/l/2953_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2953/Male/l/2953_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin by standing with your feet together, knees slightly bent, and arms to your side. This will be your starting position.", "Jump by extending the knees and ankles while raising your arms and shifting your legs outward. Land on the balls of your feet with legs apart and arms overhead.", "Re-bend the knees and jump again while lowering your arms and returning your legs to the starting position.", "Repeat for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/121141m.mp4", "name": "Jumping Jack", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5063/Male/l/5063_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5063/Male/l/5063_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start by standing with your feet together. In one motion, jump your feet out to the side and raise your arms above your head.", "Immediately reverse the motion by jumping back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118301m.mp4", "name": "Jumping Jacks", "type": "plyometrics", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2943/Male/l/2943_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2943/Male/l/2943_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your feet shoulder-width apart. Descend into a squat position by bending at the knees and hips. This will be your starting position.", "Initiate the movement by taking a step to the rear, allowing your hips and knees to flex to lower your body. Keeping your chest up and abs braced, bring your back knee all the way down to the floor, then bring your other leg back, placing your knee on the floor.", "Immediately bring that same leg back up, followed by your other leg so that you are in a low squat position.", "Extend through the hips and knees to jump up. Land back in the squat position and repeat for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123052m.mp4", "name": "Jumping Knee Up Down", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5203/Male/l/5203_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5203/Male/l/5203_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand with your feet shoulder-width apart, holding a kettlebell at waist height in front of you with both hands. You should be looking straight forward, with your chest up and shoulders back. This will be your starting position.", "Initiate the movement by shifting your weight to your right foot, lifting your left from the ground. While keeping your torso facing forward, place your left leg behind your right, taking a wide, lateral step behind the front leg.", "Descend into a lunge by bending your knees, lowering your body straight down. Continue until your front knee is at approximately 90 degrees, and then drive through the heel and extend the knee and hip.", "As you come back up, return the back leg to the starting position. Alternate the movement; switch back and forth between both sides for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/119511m.mp4", "name": "Kettlebell Curtsy Lunge", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3801/Male/l/3801_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3801/Male/l/3801_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your chest up and your feet shoulder-width apart. Bend your knees to pick up the kettlebell and swing it up to chest level. Hold the kettlebell upside down, holding on to the bell portion of the kettlebell. This will be your starting position.", "Bend at the knees and come down into a quarter squat position, keeping your hips back and chest up.", "Pick up your feet as fast as you can, running in place. Make sure that your chest stays up and your core tight.", "Continue for the recommended amount of time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123122m.mp4", "name": "Kettlebell Fire Feet", "type": "plyometrics", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5293/Male/l/5293_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5293/Male/l/5293_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Pick up a kettlebell with two hands and hold it by the horns. Hold one leg off of the floor and squat down on the other.", "Squat down by flexing the knee and sitting back with the hips, holding the kettlebell up in front of you.", "Hold the bottom position for a second and then reverse the motion, driving through the heel and keeping your head and chest up.", "Lower yourself again and repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/62000/63032m.mp4", "name": "Kettlebell Pistol Squat", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/521/Male/l/521_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/521/Male/l/521_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your chest up and your feet hip-width apart. Bend your knees to pick up the kettlebell and swing it up to chest level. This will be your starting position.", "Step one foot out to the side, bringing your feet slightly wider than shoulder-width. Bend at the knees and hips, pushing your hips back. Continue until your thighs are parallel to the ground.", "Return to the starting position by extending at the hips and knees and repeat on the opposite side.", "Complete for the recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123112m.mp4", "name": "Kettlebell Side Squat", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5283/Male/l/5283_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5283/Male/l/5283_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start with your feet shoulder-width apart and a kettlebell between your feet. This will be your starting position.", "Bend at the knees and squat down to pick up the kettlebell by the horns or handle. Keep your back flat, hips back, and core braced.", "Extend through your knees and hips and bring the kettlebell up to your chest, before quickly dropping down into a squat. At the bottom of the squat your knees should be at 90 degrees, your elbows stacked on your thighs, and your core engaged.", "Stand back up from the squat, keeping the kettlebell close to your chest, then lower it back down to the ground, returning to the starting position. This is one repetition", "Continue for the recommended number of repetitions or time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123192m.mp4", "name": "Kettlebell Squat Clean", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5483/Male/l/5483_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5483/Male/l/5483_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Use 1 or 2 hands to pick up the kettlebell, pulling it up to your chest. Hold the kettlebell at chest level with both hands, making sure to keep your arms close to your body and elbows tucked in. Your feet should be slightly wider than shoulder-width apart, with your toes pointing slightly outward. Keep your back straight and abdominals tight. This will be your starting position.", "Pushing your hips back, slowly bend the knees and lower your legs until your thighs are just below parallel to the floor. Make sure to inhale during this portion of the exercise.", "Press through the heel of the foot and push your hips through to return to the starting position. Breathe out during this phase of the exercise.", "Repeat for recommended number of repetitions before bending your knees to lower the kettle bell back to the ground."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120231m.mp4", "name": "Kettlebell Sumo Squat", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4281/Male/l/4281_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4281/Male/l/4281_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your chest up and your feet shoulder-width apart. Bend your knees to pick up the kettlebell and swing it up to chest level. Hold the kettlebell upside down, grabbing on to the horns of the kettlebell. This will be your starting position.", "Descend into a squat position by flexing at the knees and pushing your hips back. Stop once your knees hit 90 degrees and extend your arms straight down. Bring the kettlebell down inside your legs and then curl the kettlebell towards your chest.", "Next, extend through your hips and knees as you thrust the kettlebell overhead. Keep your elbows pointed towards the front, then bring the kettlebell behind your head by flexing at the elbows. Perform an overhead triceps extension to complete the thruster progression.", "Bring the kettlebell back down to the starting position. This is one repetition. Complete for the recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123132m.mp4", "name": "Kettlebell Thruster Progression", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5303/Male/l/5303_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5303/Male/l/5303_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Kneel on a mat and bring your right knee up so the bottom of your foot is on the floor and extend your left leg out behind you so the top of your foot is on the floor.", "Shift your weight forward until you feel a stretch in your hip. Hold for 15 seconds, then repeat for your other side."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60042m.mp4", "name": "Kneeling Hip Flexor", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/476/Male/l/476_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/476/Male/l/476_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin this exercise by standing with your feet hip-width apart and holding light weight dumbbells down by your side. This will be your starting position.", "While holding on to the dumbbells, hop back and forth over an imaginary line four times before turning to your left and sprinting about 20 feet.", "As soon as you finish your sprint, repeat the exercise by performing 4 more lateral hops, turning to your left, and sprinting back to your original starting position.", "Complete for recommended number of reps or time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122741m.mp4", "name": "Lateral Hop 4 Times To Sprint", "type": "plyometrics", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4841/Male/l/4841_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4841/Male/l/4841_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin this exercise by standing with your feet hip-width apart and holding light weight dumbbells down by your side. This will be your starting position.", "While holding on to the dumbbells, hop back and forth over an imaginary line for the desired number of repetitions.", "When you are done, lower the weight and place the dumbbells back on the floor."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122721m.mp4", "name": "Lateral Hop Holding Dumbbells", "type": "plyometrics", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4821/Male/l/4821_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4821/Male/l/4821_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in an athletic position with your knees bent, your feet shoulder-width apart, and your arms bent and at your sides.", "Lift your right knee high and step laterally to the right. As soon as your right foot hits the ground, lift your left knee high and step it toward your right foot.", "When your left foot touches the ground. Lift your right knee again and take another lateral step.", "Repeat this motion by taking three steps in one direction and three steps in the other.", "From there, jump forward 2-3 feet. You should be in the same position you started.", "Move quickly and stay on your toes."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118151m.mp4", "name": "Lateral Speed Step", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3173/Male/l/3173_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3173/Male/l/3173_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["For this exercise you will need to use a leg extension machine. First choose your weight and sit on the machine with your legs under the pad (feet pointed forward) and the hands holding the side bars. This will be your starting position. Tip: You will need to adjust the pad so that it falls on top of your lower leg (just above your feet). Also, make sure that your legs form a 90-degree angle between the lower and upper leg. If the angle is less than 90-degrees then that means the knee is over the toes which in turn creates undue stress at the knee joint. If the machine is designed that way, either look for another machine or just make sure that when you start executing the exercise you stop going down once you hit the 90-degree angle.", "Using your quadriceps, extend your legs to the maximum as you exhale. Ensure that the rest of the body remains stationary on the seat. Pause a second on the contracted position.", "Slowly lower the weight back to the original position as you inhale, ensuring that you do not go past the 90-degree angle limit.", "Repeat for the recommended amount of times."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/40541m.mp4", "name": "Leg Extensions", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/53/Male/l/53_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/53/Male/l/53_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).", "Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.", "As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.", "Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.", "Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/40571m.mp4", "name": "Leg Press", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/57/Male/l/57_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/57/Male/l/57_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Load the pins to an appropriate weight. Position yourself directly between the handles. Grasp the bottom handles with a comfortable grip, and then lower your hips as you take a breath. Look forward with your head and keep your chest up. This will be your starting position.", "Return the weight to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/90732m.mp4", "name": "Leverage Deadlift", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/890/Male/l/890_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/890/Male/l/890_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["You will need two boxes or benches spaced a few feet away from each other. Begin by standing on one box facing towards the other platform.", "To initiate the movement, gently drop down to the ground between your platforms, allowing the knees and hips to flex.", "Reverse the motion by exploding, extending through the hips, knees, and ankles to jump onto the other platform.", "Land softly, asborbing the impact through the legs."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99222m.mp4", "name": "Linear Depth Jump", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1141/Male/l/1141_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1141/Male/l/1141_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Kneel on the floor, holding your heels with both hands.", "Lift your buttocks up and forward while bringing your head back to look up at the ceiling, to give an arch in your back."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60082m.mp4", "name": "Looking At Ceiling", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/455/Male/l/455_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/455/Male/l/455_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position. Look directly forward, keeping your chest up, with your feet hip-width apart. This will be your starting position.", "Initiate the movement by jumping into a lunge position, allowing your hips and knees to flex to lower your body.", "Contacting the back leg through only the ball of the foot, descend until your knee nearly touches the ground. Your knee should stay in line with the foot, and your spine should remain neutral.", "After a brief pause, jump back up to a standing position, bringing your front leg back as you kick your opposite heel forward. This is one repetition.", "Complete all reps on one side before switching to the other leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122992m.mp4", "name": "Lunge Heel Kick", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5383/Male/l/5383_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5383/Male/l/5383_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Adjust a bar in a Smith machine to an appropriate height. Position yourself under the bar, racking it across the back of your shoulders. Unrack the bar, and then split your feet, moving one foot forward and one foot back. This will be your starting position.", "Lower your back knee nearly to the ground, flexing the knees and lowering your hips as you do so.", "At the bottom of the descent, immediately reverse direction. Explosively drive through the heel of your front foot with light pressure from your back foot. Jump up and reverse the position of your legs.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/104000/104392m.mp4", "name": "Lunge Sprint", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1861/Male/l/1861_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1861/Male/l/1861_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Adjust the leg machine to a height that will allow you to get inside it with your knees bent and the thighs slightly below parallel.", "Once you select the weight, position yourself inside the machine face up with the knees bent and thighs slightly below parallel to the platform. Make sure that the knees do not go past the toes. The angle created between the hamstrings and the calves should be one that is slightly less than 90 degrees (since your starting position requires you to start slightly below parallel). Your back and your head should be resting on the machine while your shoulders are pressed under the shoulder pads.", "Place your hands by the handles and position your feet slightly pointing out at a shoulder width position. This will be your starting position.", "While pressing with the balls of the feet as you breathe out, make your whole body erect as you squeeze the quads. Hold the contracted position for a second. Tip: Since you are starting below parallel, you can opt to use your hands to help you up by pressing on your thighs only on the first repetition.", "Slowly squat down as you inhale but instead of going all the way down to the starting position, just stop once your thighs are parallel to the platform. The angle between your hamstrings and calves should be a 90-degree angle.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/40761m.mp4", "name": "Lying Machine Squat", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/66/Male/l/66_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/66/Male/l/66_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Lay face down on the floor with your partner kneeling beside you. Flex one knee and raise that leg off the ground, attempting to touch your glutes with your foot.", "Have your partner kneel on your right side and place one hand on your lower back or glutes. His/her other hand should grasp your ankle or knee and push your shin toward your butt. You should feel a stretch in your quadriceps.", "After 10 seconds, try to push foot back toward the ground against your partner's resistance and hold for 6 seconds.", "Following this 6-second contraction, relax and allow your partner to stretch your quads for another 30 seconds. (If you want, try contracting your hamstrings for greater ROM gains.)", "Repeat with other leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60162m.mp4", "name": "Lying Prone Quadriceps", "type": "stretching", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/607/Male/l/607_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/607/Male/l/607_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Adjust the weight to an appropriate load for your training.", "With a shoulder-width stance, squat under the shoulder pads and adjust the machine to the appropriate height. Move to a standing position with your back slightly arched, chest up, and head looking forward. This will be your starting position.", "Lower your torso by flexing the hips and the knees.", "Continue until you are below parallel, and then reverse direction by extending the hips and the knees."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117491m.mp4", "name": "Machine Squat", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3193/Male/l/3193_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3193/Male/l/3193_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Place a medicine ball between your feet. Descend into a squat position by bending at the knees and hips. Place one hand on each side of the ball, keep your chest up and look straight ahead. This will be your starting position.", "Staying low in the squat position, pick up the medicine ball and place it a foot or two in front of you. Next, jump your feet forward to meet the ball, making sure to keep your chest up and back flat. Complete 3 reps going forward, then reverse the movement for 3 repetitions. Your hips should stay low and your feet flat on the ground.", "Repeat for the recommended number of repetitions or time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123102m.mp4", "name": "Medicine Ball Ninja", "type": "plyometrics", "equipment": "medicineball", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5273/Male/l/5273_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5273/Male/l/5273_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a pushup position, with your weight supported by your hands and toes. Flexing the knee and hip, bring one leg until the knee is approximately under the hip. This will be your starting position.", "Explosively reverse the positions of your legs, extending the bent leg until the leg is straight and supported by the toe, and bringing the other foot up with the hip and knee flexed. Repeat in an alternating fashion for 20-30 seconds."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60192m.mp4", "name": "Mountain Climbers", "type": "plyometrics", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/608/Male/l/608_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/608/Male/l/608_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Place the back of your torso against the back pad of the machine and hook your shoulders under the shoulder pads provided.", "Position your legs in the platform using a less than shoulder width narrow stance with the toes slightly pointed out. Your feet should be around 3 inches or less apart. Tip: Keep your head up at all times and also maintain the back on the pad at all times.", "Place your arms on the side handles of the machine and disengage the safety bars (which on most designs is done by moving the side handles from a facing front position to a diagonal position).", "Now straighten your legs without locking the knees. This will be your starting position.", "Begin to slowly lower the unit by bending the knees as you maintain a straight posture with the head up (back on the pad at all times). Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement.", "Begin to raise the unit as you exhale by pushing the floor with mainly with the heels of your feet as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41461m.mp4", "name": "Narrow Stance Hack Squats", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/271/Male/l/271_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/271/Male/l/271_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a less-than-shoulder-width narrow stance with the toes slightly pointed out. Your feet should be around 3 inches or less apart. Tip: Keep your head up at all times and also maintain the back on the pad at all times.", "Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.", "As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.", "Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.", "Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41451m.mp4", "name": "Narrow Stance Leg Press", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/272/Male/l/272_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/272/Male/l/272_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.", "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.", "Step away from the rack and position your legs using a less-than-shoulder-width narrow stance with the toes slightly pointed out. Feet should be around 3-6 inches apart. Keep your head up at all times (looking down will get you off balance) and maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).", "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54271m.mp4", "name": "Narrow Stance Squats", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/269/Male/l/269_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/269/Male/l/269_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin with a barbell supported on top of the traps. The chest should be up, and the head facing forward. Adopt a hip width stance with the feet turned out as needed.", "Descend by flexing the knees, refraining from moving the hips back as much as possible. This requires that the knees travel forward; ensure that they stay aligned with the feet. The goal is to keep the torso as upright as possible. Continue all the way down, keeping the weight on the front of the heel.", "At the moment the upper legs contact the lower, reverse the motion, driving the weight upward."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78242m.mp4", "name": "Olympic Squat", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/700/Male/l/700_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/700/Male/l/700_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Start off by lying on your right side, with your right knee bent at a 90-degree angle resting on the floor in front of you (this stabilizes the torso).", "Bend your left knee behind you and hold your left foot with your left hand. To stretch your hip flexor, press your left hip forward as you push your left foot back into your hand. Switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60202m.mp4", "name": "On Your Side Quad Stretch", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/402/Male/l/402_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/402/Male/l/402_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Lie on a flat bench or step, and hang one leg and arm over the side.", "Bend the knee and hold the top of the foot. As you do this, be careful not to arch your lower back.", "Pull the belly button to the spine to stay in neutral. Press your foot down and into your hand. To add the hip stretch, lift the hip of the leg you're holding up toward the ceiling.", "Switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60212m.mp4", "name": "On-Your-Back Quad Stretch", "type": "stretching", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/430/Male/l/430_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/430/Male/l/430_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Lie facedown on the floor.", "Put your left hand under your left hipbone to pad your hip and pubic bone.", "Bend your right knee so you can hold the foot in your right hand.", "Lift the foot in the air and simultaneously lift your shoulders off the floor. This also stretches the right hip flexor and the chest and shoulders. Switch sides. If it doesn't bother your back, you can try it with both arms and legs at the same time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60242m.mp4", "name": "One Half Locust", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/400/Male/l/400_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/400/Male/l/400_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Start by standing about 2 to 3 feet in front of a flat bench with your back facing the bench. Have a barbell in front of you on the floor. Tip: Your feet should be shoulder width apart from each other.", "Bend the knees and use a pronated grip with your hands being wider than shoulder width apart from each other to lift the barbell up until you can rest it on your chest.", "Then lift the barbell over your head and rest it on the base of your neck. Move one foot back so that your toe is resting on the flat bench. Your other foot should be stationary in front of you. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. Tip: Make sure your back is straight and chest is out while performing this exercise.", "As you inhale, slowly lower your leg until your thigh is parallel to the floor. At this point, your knee should be over your toes. Your chest should be directly above the middle of your thigh.", "Leading with the chest and hips and contracting the quadriceps, elevate your leg back to the starting position as you exhale.", "Repeat for the recommended amount of repetitions.", "Switch legs and repeat the movement."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41241m.mp4", "name": "One Leg Barbell Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/111/Male/l/111_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/111/Male/l/111_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Clean and press a kettlebell with one arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so. Press the weight overhead by extending through the elbow.This will be your starting position.", "Looking straight ahead and keeping a kettlebell locked out above you, flex the knees and hips and lower your torso between your legs, keeping your head and chest up.", "Pause at the bottom position for a second before rising back to the top, driving through the heels of your feet."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/62000/63262m.mp4", "name": "One-Arm Overhead Kettlebell Squats", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/522/Male/l/522_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/522/Male/l/522_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Stand to the side of a barbell next to its center. Bend your knees and lower your body until you are able to reach the barbell.", "Grasp the bar as if you were grabbing a briefcase (palms facing you since the bar is sideways). You may need a wrist wrap if you are using a significant amount of weight. This is your starting position.", "Use your legs to help lift the barbell up while exhaling. Your arms should extend fully as bring the barbell up until you are in a standing position.", "Slowly bring the barbell back down while inhaling. Tip: Make sure to bend your knees while lowering the weight to avoid any injury from occurring.", "Repeat for the recommended amount of repetitions.", "Switch arms and repeat the movement."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54331m.mp4", "name": "One-Arm Side Deadlift", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/198/Male/l/198_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/198/Male/l/198_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Start out by having a barbell in front of you on the floor. Your feet should be wider than shoulder width apart from each other.", "Bend the knees and use a pronated grip (palms facing you) to grab the barbell. Your hands should be at a wider than shoulder width apart from each other before lifting. Once you are positioned, lift the barbell up until you can rest it on your chest.", "Move the barbell over and slightly behind your head and make sure your arms are fully extended. Keep your head up at all times and also maintain a straight back. Retract your shoulder blades. This is your starting position.", "Slowly lower the weight by bending your knees until your thighs are parallel to the ground while inhaling. Tip: Keep your back straight while performing this exercise to avoid any injuries and your arms should remain extended and over your head at all times.", "Now use your feet and legs to help bring the weight back up to the starting position while exhaling.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78262m.mp4", "name": "Overhead Squat", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/248/Male/l/248_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/248/Male/l/248_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["From a standing position, raise one foot off the floor. You should be looking directly forward, with your chest up, knees and hips slightly bent, and your back straight. This will be your starting position.", "Descend into a squat by flexing your hips and knee. As you squat, extend the non-working leg forward to allow clearance for your movement. Descend slowly, paying close attention to balance and proper movement mechanics, going as far as your flexibility allows.", "Hold the bottom position briefly and then return to the start by extending through the hips and knee, driving through the heel of your working foot.", "Repeat for the desired number of repetitions, then switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117851m.mp4", "name": "Pistol Squat", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3481/Male/l/3481_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3481/Male/l/3481_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Hold a dumbbell at the base with both hands and stand straight up. Move your legs so that they are wider than shoulder width apart from each other with your knees slightly bent.", "Your toes should be facing out. Note: Your arms should be stationary while performing the exercise. This is the starting position.", "Slowly bend the knees and lower your legs until your thighs are parallel to the floor. Make sure to inhale as this is the eccentric part of the exercise.", "Press mainly with the heel of the foot to bring the body back to the starting position while exhaling.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/40951m.mp4", "name": "Plie Dumbbell Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/43/Male/l/43_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/43/Male/l/43_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position your legs using a wider-than-shoulder-width stance with the toes slightly pointed out and knees slightly bent. Rest your hands on your hips. Keep your neck neutral and maintain a straight back. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "Once you reach your bottom position, begin to push through your heels to ascend upwards.", "Generate enough power to jump upwards. As you jump upwards, bring both feet inward towards one another so that you land with your feet a few inches apart. Be sure to land on your toes.", "As you land on your toes with your feet closer together, immediately propel yourself upwards and jump to return to the starting position. This is one repetition.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/121011m.mp4", "name": "Pop Squat", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4551/Male/l/4551_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4551/Male/l/4551_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible.", "Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.", "At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be moved to a slightly wider stance, with the knees partially bent.", "Receive the bar with the arms locked out overhead.", "Return to a standing position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78322m.mp4", "name": "Power Jerk", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/702/Male/l/702_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/702/Male/l/702_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin with a loaded barbell on boxes or stands of the desired height. A wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar, with the elbows pointed out. This will be the starting position.", "Begin the first pull by driving through the front of the heels, raising the bar from the boxes.", "Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.", "As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move to just outside the hips, turned out as necessary. Receive the bar above a full squat and with the arms fully extended overhead.", "Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position. Carefully return the weight to the boxes."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76912m.mp4", "name": "Power Snatch from Blocks", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/747/Male/l/747_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/747/Male/l/747_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Lay on your side. Loop a belt, rope, or band around your top foot. Flex the knee and extend your hip, attempting to touch your glutes with your foot, and holding the belt with your hands. This will be your starting position.", "With the belt being held over the shoulder or overhead, gently pull to increase the stretch in the quadriceps. Hold for 10-20 seconds, and then switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60372m.mp4", "name": "Quad Stretch", "type": "stretching", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/614/Male/l/614_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/614/Male/l/614_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Lay facedown on the floor with your weight supported by your hands or forearms. Place a foam roll underneath one leg on the quadriceps, and keep the foot off of the ground. Make sure to relax the leg as much as possible. This will be your starting position.", "Shifting as much weight onto the leg to be stretched as is tolerable, roll over the foam from above the knee to below the hip, holding points of tension for 10-30 seconds. Switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/61032m.mp4", "name": "Quadriceps-SMR", "type": "stretching", "equipment": "foamroll", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/615/Male/l/615_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/615/Male/l/615_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["You will need a box for this exerise.", "Begin facing the box standing 1-2 feet from its edge.", "By utilizing your hips, hop onto the box, landing on both legs. Ensure that you land with your legs bent and your feet flat.", "Immediately upon landing, fully extend through the entire body and swing your arms overhead to explode off of the box. Use your legs to absorb the impact of landing."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91652m.mp4", "name": "Quick Leap", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/810/Male/l/810_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/810/Male/l/810_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Place yourself on your hands knees on an exercise mat. Your head should be looking forward and the bend of the knees should create a 90-degree angle between the hamstrings and the calves. This will be your starting position.", "Extend one leg up and behind you. The knee and hip should both extend. Repeat for 5-10 repetitions, and then switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60382m.mp4", "name": "Rear Leg Raises", "type": "stretching", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/634/Male/l/634_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/634/Male/l/634_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, seat yourself on the bike and adjust the seat to your height.", "Select the desired option from the menu. You may have to start pedaling to turn it on. You can use the manual setting, or you can select a program to use. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. The level of resistance can be changed throughout the workout. The handles can be used to monitor your heart rate to help you stay at an appropriate intensity.", "Recumbent bikes offer convenience, cardiovascular benefits, and have less impact than other activities. A 150 lb person will burn about 230 calories cycling at a moderate rate for 30 minutes, compared to 450 calories or more running."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71812m.mp4", "name": "Recumbent Bike", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/650/Male/l/650_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/650/Male/l/650_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a power rack with a box at the appropriate height behind you. Set up the bands either on band pegs or attached to the top of the rack, ensuring they will be directly above the bar during the squat. Attach the other end to the bar.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.", "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.", "Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76472m.mp4", "name": "Reverse Band Box Squat", "type": "powerlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/753/Male/l/753_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/753/Male/l/753_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in a power rack with the pins and bar set at the appropriate height. After loading the bar, attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end of the bands to the bar.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings.", "Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.", "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77062m.mp4", "name": "Reverse Band Power Squat", "type": "powerlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/757/Male/l/757_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/757/Male/l/757_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position, with your feet hip-width apart, arms extended overhead, and core braced. This will be your starting position.", "Bend at the knees, and in a single controlled motion, lower yourself to the floor, rolling onto your back and bringing your knees in towards your chest. Keep your hands overhead.", "Use momentum to kick forward, landing back on both feet.", "Extend through your knees and hips to stand up, and explosively jump straight up, getting as much height as you can.", "Repeat for the recommended number of repetitions or time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123152m.mp4", "name": "Reverse Burpee", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5403/Male/l/5403_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5403/Male/l/5403_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Load the frame with the desired weight. Center yourself between the handles. You feet should be about hip width apart. Bend at the hips to grip the handles, allowing your shoulder blades to protract.", "With your feet and your grip set, take a big breath and then lower your hips and flex the knees. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. As the weight comes up, pull your shoulder blades together as you drive your hips forward.", "Lower the weight by bending at the hips and guiding it to the ground."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76992m.mp4", "name": "Rickshaw Deadlift", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/743/Male/l/743_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/743/Male/l/743_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.", "To initiate the move, squat down halfway and explode back up as high as possible.", "Fully extend your entire body, reaching overhead as far as possible. As you land, absorb your impact through the legs."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94922m.mp4", "name": "Rocket Jump", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/812/Male/l/812_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/812/Male/l/812_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Hold an end of the rope in each hand. Position the rope behind you on the ground. Raise your arms up and turn the rope over your head bringing it down in front of you. When it reaches the ground, jump over it. Find a good turning pace that can be maintained. Different speeds and techniques can be used to introduce variation.", "Rope jumping is exciting, challenges your coordination, and requires a lot of energy. A 150 lb person will burn about 350 calories jumping rope for 30 minutes, compared to over 450 calories running."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71832m.mp4", "name": "Rope Jumping", "type": "cardio", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/651/Male/l/651_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/651/Male/l/651_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, seat yourself on the rower. Make sure that your heels are resting comfortably against the base of the foot pedals and that the straps are secured. Select the program that you wish to use, if applicable. Sit up straight and bend forward at the hips.", "There are three phases of movement when using a rower. The first phase is when you come forward on the rower. Your knees are bent and against your chest. Your upper body is leaning slightly forward while still maintaining good posture.Next, push against the foot pedals and extend your legs while bringing your hands to your upper abdominal area, squeezing your shoulders back as you do so. To avoid straining your back, use primarily your leg and hip muscles.", "The recovery phase simply involves straightening your arms, bending the knees, and bringing your body forward again as you transition back into the first phase."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71852m.mp4", "name": "Rowing, Stationary", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/652/Male/l/652_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/652/Male/l/652_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position. Look directly forward, keeping your chest up, with your feet hip-width apart. This will be your starting position.", "Initiate the movement by taking a step to the rear, allowing your hips and knees to flex to lower your body. Contacting the back leg through only the ball of the foot, descend until your knee nearly touches the ground The knee should stay in line with the foot, and your spine should remain neutral.", "After a brief pause, stand back up by driving through the heel of the front leg to extend the knees and hips.", "At the top, continue to bring your back leg through, flexing at the knee and hip to bring your knee as high as you can.", "Reverse the motion to return to the starting position before starting the next repetition.", "Complete all reps on one side before switching to the other leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122952m.mp4", "name": "Running Lunge", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5323/Male/l/5323_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5323/Male/l/5323_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.", "Treadmills offer convenience, cardiovascular benefits, and usually have less impact than running outside. A 150 lb person will burn over 450 calories running 8 miles per hour for 30 minutes. Maintain proper posture as you run, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71872m.mp4", "name": "Running, Treadmill", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/653/Male/l/653_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/653/Male/l/653_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To load sandbags or other objects, begin with the implements placed a distance from the loading platform, typically 50 feet.", "Begin by lifting the sandbag. Sandbags are extremely awkward, and the manner of lifting them can vary depending on the particular sandbag used. Reach as far around it as possible, extending through the hips and knees to pull it up high. Shouldering is usually not allowed.", "Move as quickly as possible to the platform, and load it, extending through your hips, knees, and ankles to get it as high as possible. Place it onto the platform, ensuring it doesn't fall off.", "Return to the starting position to retrieve the next sandbag, and repeat until the event is completed."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78012m.mp4", "name": "Sandbag Load", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/711/Male/l/711_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/711/Male/l/711_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.", "Ensure that the front knee is over the midline of the foot. Extending through both legs, jump as high as possible, swinging your arms to gain lift.", "As you jump as high as you can, switch the position of your legs, moving your front leg to the back and the rear leg to the front.", "As you land, absorb the impact through the legs by adopting the lunge position, and repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94942m.mp4", "name": "Scissors Jump", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/813/Male/l/813_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/813/Male/l/813_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Adjust the bottom position of the machine and seat yourself.", "Select an appropriate load for your training, and then plant your feet a little wider than shoulder width on the platform. Grasp the handles, maintaining good spinal position with your chest up and your head looking forward. This will be your starting position.", "Driving through the heels of your feet, extend through the hips and knees to push the sled upward. Do not lock out your knees.", "After holding the top position for a movement, return to the starting position without fully returning the weight to the stack."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118001m.mp4", "name": "Seated Leg Press", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3411/Male/l/3411_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3411/Male/l/3411_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand to the side of a cone or hurdle.", "Begin this drill by hopping sideways over the obstacle, rebounding out of your landing to hop back to where you started.", "Hop for a prescribed number or repetitions as quickly as possible, and finish this drill by sprinting a short distance upon landing the last hop."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91692m.mp4", "name": "Side Hop-Sprint", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/816/Male/l/816_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/816/Male/l/816_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Assume an athletic standing position, with the knees and hips slightly bent, feet shoulder-width apart, and the head and chest up. This will be your starting position.", "Staying low, take a slow, lateral step to the right. Keep your toes pointed forward and stay low. Extend the left knee, driving your weight to the right, flexing the knee and hip into a side lunge. Maintain good posture through the entire spine, keeping your head and chest up.", "Pause at the bottom of the motion, and then extend through the working leg to return to a standing position, transitioning into a lunge to the opposite side."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117881m.mp4", "name": "Side Lunge", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2873/Male/l/2873_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2873/Male/l/2873_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Assume an athletic standing position, with the knees and hips slightly bent, feet hip-width apart, and the head and chest up. This will be your starting position.", "Staying low, take a slow, lateral step to the right. Keep your toes pointed forward and stay low. Extend the left knee, driving your weight to the right, flexing the knee and hip into a side lunge.", "As you lower yourself, reach across with your left hand to touch your right heel or ankle. Maintain good posture through the entire spine, keeping your head and chest up.", "Pause at the bottom of the motion, and then extend through the working leg to return to a standing position, transitioning into a lunge to the opposite side."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/121201m.mp4", "name": "Side Lunge Touching Heel", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5083/Male/l/5083_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5083/Male/l/5083_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet hip width apart in an athletic stance. Your head and chest should be up, knees and hips slightly bent. This will be your starting position.", "Leaning to your right, extend through your hips, knees, and ankles to jump into the air. Block with the arms to lead the movement, jumping as far to your right as you can.", "Land facing the same direction with your feet hip width apart, absorbing the impact through your lower body."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99362m.mp4", "name": "Side Standing Long Jump", "type": "plyometrics", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/971/Male/l/971_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/971/Male/l/971_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand to one side of the box with your left foot resting on the middle of it.", "To begin, jump up and over to the other side of the box, landing with your right foot on top of the box and your left foot on the floor. Swing your arms to aid your movement.", "Continue shuffling back and forth across the box."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91712m.mp4", "name": "Side to Side Box Shuffle", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/817/Male/l/817_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/817/Male/l/817_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["From a standing position, press a single kettlebell overhead by extending the elbow and flexing the shoulder. You should be looking directly forward, with your chest up, knees and hips slightly bent, and your back straight. This will be your starting position.", "Descend into a squat by flexing your hips and knees. As you squat, keep your weight on your heels and push your knees out. Maintain proper curvature of your entire spine, from the lower back all the way up through your cervical spine. Descend as far as your flexibility allows or until you have reached a full squat position. Avoid excessive forward lean, rounding your lumbar or thoracic spine, and keep the kettlebell in place throughout the exercise.", "After a brief pause, return to the starting position by extending through the hips and knees. Repeat for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/116482m.mp4", "name": "Single Arm Overhead Kettlebell Squat", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2793/Male/l/2793_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/2793/Male/l/2793_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin by standing on one leg, with the bent knee raised. This will be your start position.", "Using a countermovement jump, take off upward by extending the hip, knee, and ankle of the grounded leg.", "Immediately flex the knee and attempt to touch your butt with the heel of your jumping leg.", "Return the leg to a partially bent position underneath the hips and land. Your opposite leg should stay in relatively the same position throughout the drill."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94962m.mp4", "name": "Single Leg Butt Kick", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/819/Male/l/819_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/819/Male/l/819_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand on the ground with one foot resting on the box, heel close to the edge.", "Push off with your foot on top of the box, trying to gain as much height as possible by extending through the hip and knee.", "Land with the same foot on top of the box, returning your other foot back to the start position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91732m.mp4", "name": "Single Leg Push-off", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/818/Male/l/818_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/818/Male/l/818_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["From a standing position, press a single dumbbell overhead by extending the elbow and flexing the shoulder. You should be looking directly forward, with your chest up, knees and hips slightly bent, and your back straight. This will be your starting position.", "Descend into a squat by flexing your hips and knees. As you squat, keep your weight on your heels and push your knees out. Maintain proper curvature of your entire spine, from the lower back all the way up through your cervical spine.", "Descend as far as your flexibility allows or until you have reached a full squat position. Avoid excessive forward lean, rounding your lumbar or thoracic spine, and keep the dumbbell in place throughout the exercise.", "After a brief pause, return to the starting position by extending through the hips and knees. Repeat for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/119471m.mp4", "name": "Single-Arm Dumbbell Overhead Squat", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3781/Male/l/3781_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3781/Male/l/3781_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This drill teaches quick foot action. You need a single cone. Begin standing next to the cone with one arm back and one arm forward.", "Chop the feet as quickly as possible, blocking with the arms. Circle the cone, keep your knees up, with violent foot action.", "Rest after three trips around the cone."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99342m.mp4", "name": "Single-Cone Sprint Drill", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/981/Male/l/981_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/981/Male/l/981_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Select a box or step of a height appropriate to your abilities. Single-leg jumps will require lower boxes than double-legged versions, and caution should be used due to a higher risk associated with the exercise. To begin, stand 6-12 inches in front of the box. Your feet should be shoulder-width apart, your knees and hips slightly bent, with good posture throughout your spine. This will be your starting position.", "To initiate the movement, lift one foot slightly off the floor to transfer the load to the working leg. Begin flexing the hips and knees into a quarter squat, generating an elastic force that will be used to power your jump. Swing your arms behind you in preparation for the movement.", "Explode out of the hole, extending your hip, knee, and ankle of your working leg to propel you upward and slightly forward, striving for maximum height. Swing your arms forward as you jump for added momentum.", "As you land on the platform, absorb the impact by allowing the hips and knees to flex into a partial squat. Use both legs to step down and return to the starting position. It is not advised to jump down from the box during this exercise."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120031m.mp4", "name": "Single-Leg Box Jump", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4071/Male/l/4071_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4071/Male/l/4071_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Position a box in a rack. Secure a band or rope in place above the box.", "Standing in front of it, step onto the box to a full standing position, letting your other leg remain unsupported. Hold onto the band for balance", ". Continue stepping up and down on the same leg before switching to the opposite side."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99132m.mp4", "name": "Single-Leg High Box Squat", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1231/Male/l/1231_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1231/Male/l/1231_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Arrange a line of cones in front of you. Assume a relaxed standing position, balanced on one leg. Raise the knee of your opposite leg. This will be your starting position.", "Hop forward, jumping and landing with the same leg over the cone.", "Use a countermovement jump to hop from cone to cone.", "At the end, turn around and go back on the other leg."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99602m.mp4", "name": "Single-Leg Hop Progression", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/821/Male/l/821_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/821/Male/l/821_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand to the side of a cone or hurdle. To get into the start position, stand on one leg with your knee slightly bent.", "To begin, execute a counterjump to hop sideways over the cone.", "Land on your jumping leg, and immediately rebound out of it by jumping back to the start position.", "Continue hopping back and forth."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99632m.mp4", "name": "Single-Leg Lateral Hop", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/822/Male/l/822_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/822/Male/l/822_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Seat yourself in the machine and adjust it so that you are positioned properly. The pad should be against the lower part of the shin but not in contact with the ankle. Adjust the seat so that the pivot point is in line with your knee. Select a weight appropriate for your abilities.", "Maintaining good posture, fully extend one leg, pausing at the top of the motion.", "Return to the starting position without letting the weight stop, keeping tension on the muscle.", "Repeat for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99282m.mp4", "name": "Single-Leg Leg Extension", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1091/Male/l/1091_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1091/Male/l/1091_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Load the sled to an appropriate weight. Seat yourself on the machine, planting one foot on the platform in line with your hip. Your free foot can be placed on the ground. Maintain good spinal position with your head and chest up.", "Supporting the weight, fully extend the knee and unlock the sled. This will be your starting position.", "Lower the weight by flexing the hip and knee, continuing as far as flexibility allows. Do not allow your lumbar to take the load by moving your pelvis.", "At the bottom of the motion pause briefly and then return to the starting position by extending the hip and knee.", "Complete all repetitions for one leg before switching to the other."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/119151m.mp4", "name": "Single-Leg Press", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3941/Male/l/3941_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3941/Male/l/3941_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin with a pad or BOSU ball placed directly behind you and your feet hip-width apart.", "Transition your weight to your dominate leg and lift the opposite leg slightly off the floor. Keep your neck neutral and maintain a straight back. This will be your starting position.", "Slowly descend by pushing your hips and butts backwards. Continue descending until the knee of your bent and raised leg lightly touches the pad or BOSU ball.", "Upon contact, push through the heel of your stationary leg and return to the starting position. This is one repetition.", "Repeat for the recommended number of repetitions and then switch legs."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120951m.mp4", "name": "Single-Leg Skater Squat", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4521/Male/l/4521_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4521/Male/l/4521_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Choose a bench or box so that when you sit on it, your knee is bent at 90 degrees. Begin by standing 6-12 inches in front of the boxes, in a hip-width stance and your knees slightly bent (when you descend, your butt should hit the edge of the box). Have your arms down by your side or out in front of you for added stability.", "Start with your dominate leg as your stationary, working leg. Fully extend your opposite leg and raise it 6-8 inches off the ground straight in front of you. This will be your starting position.", "Bending at the knee of your stationary leg, push the hips and butt back and begin to descend towards the box. As you descend, your other leg will remain hovering off of the ground.", "Continue until your butt touches the box. Allow it to gently touch before immediately pushing through your heels and returning to the starting position.", "Repeat for recommended amount of repetitions and then switch legs."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120931m.mp4", "name": "Single-Leg Squat To Box", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4511/Male/l/4511_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4511/Male/l/4511_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand to the side of a box with your inside foot on top of it, close to the edge.", "Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Attempt to drive the opposite knee upward.", "Land in the same position that you started, using your inside leg to decelerate the impact."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91752m.mp4", "name": "Single-Leg Stride Jump", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/824/Male/l/824_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/824/Male/l/824_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand with your feet shoulder width apart. This will be your starting position.", "Begin the movement by flexing your knees and hips, sitting back with your hips.", "Continue until you have squatted a portion of the way down, but are above parallel, and quickly reverse the motion until you return to the starting position. Repeat for 5-10 repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60612m.mp4", "name": "Sit Squats", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/637/Male/l/637_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/637/Male/l/637_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Roller skating is a fun activity which can be effective in improving cardiorespiratory fitness and muscular endurance. It requires relatively good balance and coordination. It is necessary to learn the basics of skating including turning and stopping and to wear protective gear to avoid possible injury.", "You can skate at a comfortable pace for 30 minutes straight. If you want a cardio challenge, do interval skating â€“ speed skate two minutes of every five minutes, using the remaining three minutes to recover. A 150 lb person will typically burn about 175 calories in 30 minutes skating at a comfortable pace, similar to brisk walking."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/72000/72312m.mp4", "name": "Skating", "type": "cardio", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/654/Male/l/654_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/654/Male/l/654_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, load the sled with the desired weight and attach the pulling strap. You can pull with handles, use a harness, or attach the pulling strap to a weight belt.", "Whether pulling forwards or backwards, lean in the direction of travel and progress by extending through the hips and knees."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77942m.mp4", "name": "Sled Drag - Harness", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/713/Male/l/713_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/713/Male/l/713_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Load your pushing sled with the desired weight.", "Take an athletic posture, leaning into the sled with your arms fully extended, grasping the handles. Push the sled as fast as possible, focusing on extending your hips and knees to strengthen your posterior chain."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/95811m.mp4", "name": "Sled Push", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/714/Male/l/714_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/714/Male/l/714_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in an athletic position with your knees bent and your chest up.", "Take a lateral step to the right and then bring your feet together.", "As soon as your feet come together, jump up with your arms in the air as if you were shooting a basketball.", "When you come down, take a lateral step to the left and repeat the movement. Move as quickly as you can."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118351m.mp4", "name": "Slide Jump Shot", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3073/Male/l/3073_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3073/Male/l/3073_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet shoulder-width apart. Your arms should be bent and at your sides.", "Lift your right knee up until it reaches your waist. Your left arm should swing forward while your right arm swings back. Keep your left knee slightly bent and allow it to spring.", "Return your right foot to the ground as you lift your left knee. Swing your right arm forward and your left arm back. Keep your right knee slightly bent and allow it to spring.", "Repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117202m.mp4", "name": "Slow Jog", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3083/Male/l/3083_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3083/Male/l/3083_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position a Smith machine bar a couple feet off of the ground. Ensure that it is resting on the safeties. After loading the bar to an appropriate weight, lie underneath the bar. Place the middle of your feet on the bar, tucking your knees to your chest. This will be your starting position.", "Begin the movement by driving through your feet to move the bar upward, extending the hips and knees. Do not lock out your knees.", "At the top of the motion, pause briefly before returning to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/104000/104372m.mp4", "name": "Smith Machine Leg Press", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1871/Male/l/1871_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1871/Male/l/1871_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, first set the bar to a position that best matches your height. Step under it and position the bar across the back of your shoulders.", "Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs.3", "Move one foot forward about 12 inches in front of the bar. Extend the other leg out in front of you, holding it off the ground. Look forward at all times and maintain a neutral or slightly arched spine. This will be your starting position.", "Maintaining good posture, lower yourself by flexing the knee and hip, going down as far as flexibility allows.", "Pause briefly at the bottom and then return to the starting position by driving through the heel of your foot, extending the knee and hip."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/104000/104382m.mp4", "name": "Smith Machine Pistol Squat", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1881/Male/l/1881_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1881/Male/l/1881_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, first set the bar on the height that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.", "Hold on to the bar using both arms at each side (palms facing forward), unlock it and lift it off the rack by first pushing with your legs and at the same time straightening your torso.", "Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance which targets overall development; however you can choose any of the three stances discussed in the foot stances section).", "Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41261m.mp4", "name": "Smith Machine Squat", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/65/Male/l/65_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/65/Male/l/65_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, place a flat bench 2-3 feet behind the smith machine. Then, set the bar on the height that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.", "Hold on to the bar using both arms at each side (palms facing forward), unlock it and lift it off the rack by first pushing with your legs and at the same time straightening your torso.", "Position your legs by placing one foot slightly forward under the bar and extending your other leg back and place the top of your foot on the bench. This will be your starting position", "Begin to slowly lower the bar by bending the knee as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calf becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knee should make an imaginary straight line with the toes that is perpendicular to the front. If your knee is past that imaginary line (if it is past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten your leg again and go back to the starting position.", "Repeat for the recommended amount of repetitions.", "Switch legs and repeat the movement."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41321m.mp4", "name": "Smith Single-Leg Split Squat", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/330/Male/l/330_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/330/Male/l/330_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Place your feet at a shoulder width stance with the barbell resting right above the connection between the toes and the rest of the foot.", "With a palms facing down grip, bend at the knees and keeping the back flat grab the bar using a wider than shoulder width grip. Bring the hips down and make sure that your body drops as if you were going to sit on a chair. This will be your starting position.", "Start pushing the floor as if it were a moving platform with your feet and simultaneously start lifting the barbell keeping it close to your legs.", "As the bar reaches the middle of your thighs, push the floor with your legs and lift your body to a complete extension in an explosive motion.", "Lift your shoulders back in a shrugging movement as you bring the bar up while lifting your elbows out to the side and keeping them above the bar for as long as possible.", "Now in a very quick but powerful motion, you have to get your body under the barbell when it has reached a high enough point where it can be controlled and drop while locking your arms and holding the barbell overhead as you assume a squat position.", "Finalize the movement by rising up out of the squat position to finish the lift. At the end of the lift both feet should be on line and the arms fully extended holding the barbell overhead."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77922m.mp4", "name": "Snatch", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/187/Male/l/187_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/187/Male/l/187_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin with the feet in the pulling position, the bar racked across the back of the shoulders, and the hands placed in a wide snatch grip.", "Pop the bar with an abrupt dip and drive of the knees, and aggressively drive under the bar, transitioning the feet into the receiving position.", "Receive the bar locked out overhead near the bottom of the squat. The torso should remain vertical, lowering the hips between the legs.", "Continue to descend to full depth, and return to a standing position. Carefully lower the weight."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77902m.mp4", "name": "Snatch Balance", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/715/Male/l/715_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/715/Male/l/715_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin with a loaded barbell on boxes or stands of the desired height. A wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar, with the elbows pointed out. This will be the starting position.", "Begin the first pull by driving through the front of the heels, raising the bar from the boxes.", "Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.", "As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move to just outside the hips, turned out as necessary. Receive the bar with your body as low as possible and the arms fully extended overhead.", "Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position. Carefully return the weight to the boxes."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76972m.mp4", "name": "Snatch from Blocks", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/745/Male/l/745_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/745/Male/l/745_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your chest up and your feet hip-width apart. This will be your starting position.", "Bend at the knees and hips, placing one hand on the ground and jumping your feet out slightly wider than hip-distance apart.", "Keeping your one hand on the ground, quickly cross your feet, then jump them back out before jumping into a wide squat.", "Jump back up to the starting position and repeat with the other arm. Make sure to alternate arms each rep."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122962m.mp4", "name": "Southpaw Sprawl", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5353/Male/l/5353_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5353/Male/l/5353_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Attach bands to the bar that are securely anchored near the ground. You may need to choke the bands to get adequate tension.", "Use a box of an appropriate height for this exercise. Load the bar to a weight that still requires effort, but isn't so heavy that speed is compromised. Typically, that will be between 50-70% of your one rep max.", "Position the bar on your upper back, shoulder blades retracted, back arched and everything tight head to toe. This will be the starting position.", "Unrack the bar and position yourself in front of the box. Sit back with your hips until you are seated on the box, ensuring that you descend under control and don't crash onto the surface.", "Pause briefly, and explode off of the box, extending through the hips and knees."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99122m.mp4", "name": "Speed Box Squat", "type": "powerlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1241/Male/l/1241_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1241/Male/l/1241_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.", "Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.", "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance which targets overall development; however you can choose any of the three stances discussed in the foot stances section).", "Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as fast as possible without involving momentum as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position. Note: You should perform these exercises as fast as possible but without breaking perfect form and without involving momentum.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41351m.mp4", "name": "Speed Squats", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/268/Male/l/268_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/268/Male/l/268_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["With a barbell on the floor close to the shins, take an overhand grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.", "Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.", "Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.", "As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so.", "Receive the bar with the feet split, aggressively moving one foot forward and one foot back. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom position, which will help in the recovery.", "Immediately recover by driving through the heels, keeping the torso upright and elbows up. Bring the feet together as you stand up."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77822m.mp4", "name": "Split Clean", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/755/Male/l/755_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/755/Male/l/755_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward.", "Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders. At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible.", "In the brief moment the feet are not actively driving against the platform, the athleteâ€™s effort to push the bar up will drive them down. The feet should be moved to a split stance, one foot forward, one foot back, with the knees partially bent. Receive the bar with the arms locked out overhead.", "Return to a standing position, bringing the feet together."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77762m.mp4", "name": "Split Jerk", "type": "olympicweightlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/719/Male/l/719_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/719/Male/l/719_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.", "Ensure that the front knee is over the midline of the foot.", "Extending through both legs, jump as high as possible, swinging your arms to gain lift.", "As you jump, bring your feet together, and move them back to their initial positions as you land.", "Absorb the impact by reverting back to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94982m.mp4", "name": "Split Jump", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/826/Male/l/826_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/826/Male/l/826_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position yourself into a staggered stance with the rear foot elevated and front foot forward.", "Hold a dumbbell in each hand, letting them hang at the sides. This will be your starting position.", "Begin by descending, flexing your knee and hip to lower your body down. Maintain good posture througout the movement. Keep the front knee in line with the foot as you perform the exercise.", "At the bottom of the movement, drive through the heel to extend the knee and hip to return to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/94752m.mp4", "name": "Split Squat with Dumbbells", "type": "strength", "equipment": "dumbbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/800/Male/l/800_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/800/Male/l/800_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position yourself into a staggered stance with the rear foot elevated and front foot forward. Hold a kettlebell in each hand, letting them hang by your side. This will be your starting position.", "Begin by descending, flexing your knee and hip to lower your body down. Maintain good posture throughout the movement. Keep the front knee in line with your foot as your perform the exercise.", "At the bottom of the movement drive through the heel to extend the knee and hip to return to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/119911m.mp4", "name": "Split Squat With Kettlebells", "type": "strength", "equipment": "kettlebells", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4141/Male/l/4141_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4141/Male/l/4141_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position. Look directly forward, keeping your chest up, with your feet hip-distance apart. This will be your starting position.", "Bend at the knees and hips and place your hands on the floor while kicking your feet out behind you slightly wider than hip-distance apart. Bring your knees in towards your elbows quickly, without letting your toes touch the ground, then extend them back out behind you.", "Next, jump your legs back in, bringing them just outside your hands to a wide squat position. From here, jump all the way up, reaching your hands above your head.", "Land with your knees slightly bent, and then go immediately into the next rep. Continue for the desired number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123042m.mp4", "name": "Sprawl Frog Kick", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5193/Male/l/5193_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5193/Male/l/5193_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in an athletic position with your knees bent, your feet shoulder-width apart, and your arms bent and at your sides.", "Jump laterally about 2-3 feet to the left.", "Once you land, quickly jump backwards about 2-3 feet.", "When your feet hit the ground, quickly jump laterally to the right about 2-3 feet.", "From there, jump forward 2-3 feet. You should be in the same position you started.", "Repeat this drill by doing the 4 jumps in various directions, but always making a square."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118161m.mp4", "name": "Square Hop", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3163/Male/l/3163_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3163/Male/l/3163_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.", "At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athleteâ€™s effort to push the bar up will drive them down. The feet should move forcefully to just outside the hips, turned out as necessary. Receive the bar with your body in a full squat and the arms fully extended overhead.", "Keeping the bar aligned over the front of the heels, your head and chest up, drive throught heels of the feet to move to a standing position. Carefully return the weight to floor."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/76602m.mp4", "name": "Squat Jerk", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/721/Male/l/721_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/721/Male/l/721_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward.", "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.", "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78372m.mp4", "name": "Squat with Bands", "type": "powerlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/704/Male/l/704_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/704/Male/l/704_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.", "Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward.", "With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.", "Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/78000/78392m.mp4", "name": "Squat with Chains", "type": "powerlifting", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/705/Male/l/705_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/705/Male/l/705_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, first set the bar on a rack to just below shoulder level. Position a weight plate on the ground a couple feet back from the rack. Once the bar is loaded, step under it and place the back of your shoulders across it.", "Hold on to the bar with both hands and lift it off the rack by first pushing with your legs and at the same time straighten your torso.", "Step away from the rack and adopt a wide stance with the toes slightly pointed out, with one foot on the weight plate. Keep your head up at all times. This will be your starting position.", "Begin to slowly lower the bar by bending the knees and hips. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees.", "Raise the bar as you exhale by pushing the floor with the heels of your feet as you extend the hips and knees.", "At the top of the movement, side step, bringing your feet together on the opposite side of the plate.", "Using your inside foot, push the weight plate, sliding it across the floor to where you were just standing.", "Place your inside foot on the weight plate, adopting a wide stance for the next repetition."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/104000/105122m.mp4", "name": "Squat with Plate Movers", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1831/Male/l/1831_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1831/Male/l/1831_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To start out, make sure that the exercise band is at an even split between both the left and right side of the body. To do this, use your hands to grab both sides of the band and place both feet in the middle of the band. Your feet should be shoulder width apart from each other.", "When holding the bands, they should be the same height on each side. You should be using a pronated grip (palms facing forward) and have the handles of the bands next to your face for this exercise. This is the starting position.", "Slowly start to bend the knees and lower the legs so that your thighs are parallel to the floor while exhaling.", "Use the heel of your feet to push your body up to the starting position as you exhale.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41391m.mp4", "name": "Squats - With Bands", "type": "strength", "equipment": "bands", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/260/Male/l/260_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/260/Male/l/260_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, step onto the stairmaster and select the desired option from the menu. You can choose a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise.", "Pump your legs up and down in an established rhythm, driving the pedals down but not all the way to the floor. It is recommended that you maintain your grip on the handles so that you donâ€™t fall. The handles can be used to monitor your heart rate to help you stay at an appropriate intensity.", "Stairmasters offer convenience, cardiovascular benefits, and usually have less impact than running outside. They are typically much harder than other cardio equipment. A 150 lb person will typically burn over 300 calories in 30 minutes, compared to about 175 calories walking."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71892m.mp4", "name": "Stairmaster", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/655/Male/l/655_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/655/Male/l/655_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Start by standing with your back about two to three feet away from a bench or step.", "Lift one leg behind you and rest your foot on the step,either on your instep or the ball of your foot, whichever you find most comfortable.", "Keep your supporting knee slightly bent and avoid letting that knee extend out beyond your toes. Switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60722m.mp4", "name": "Standing Elevated Quad Stretch", "type": "stretching", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/443/Male/l/443_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/443/Male/l/443_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand up straight with the spine vertical, the left foot slightly in front of the right.", "Bend both knees and lift the back heel off the floor as you press the right hip forward. You can't get a thorough, deep stretch in this position, however, because it's hard to relax the hip flexor and stand on it at the same time. Switch sides."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/60000/60752m.mp4", "name": "Standing Hip Flexors", "type": "stretching", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/444/Male/l/444_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/444/Male/l/444_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["This drill is best done in sand or other soft landing surface. Ensure that you are able to measure distance. Stand in a partial squat stance with feet shoulder width apart.", "Utilizing a big arm swing and a countermovement of the legs, jump forward as far as you can.", "Attempt to land with your feet out in front you, reaching as far as possible with your legs.", "Measure the distance from your landing point to the starting point and track results."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/95002m.mp4", "name": "Standing Long Jump", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/831/Male/l/831_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/831/Male/l/831_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.", "To initiate the move, squat down halfway and explode back up as high as possible. Fully extend your entire body, spreading your legs and arms away from the body.", "As you land, bring your limbs back in and absorb your impact through the legs."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/94000/95032m.mp4", "name": "Star Jump", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/835/Male/l/835_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/835/Male/l/835_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["To begin, step onto the stepmill and select the desired option from the menu. You can choose a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Use caution so that you donâ€™t trip as you climb the stairs. It is recommended that you maintain your grip on the handles so that you donâ€™t fall.", "Stepmills offer convenience, cardiovascular benefits, and usually have less impact than running outside while offering a similar rate of calories burned. They are typically much harder than other cardio equipment. A 150 lb person will typically burn over 300 calories in 30 minutes, compared to about 175 calories walking."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71912m.mp4", "name": "Step Mill", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/656/Male/l/656_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/656/Male/l/656_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Stand to the side of a box with your inside foot on top of it, close to the edge.", "Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Attempt to drive the opposite knee upward.", "Land in the opposite position that you started, on the opposite side of the box. The foot that was initially on the box will now be on the ground, with the opposite foot now on the box.", "Repeat the movement, crossing back over to the other side."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99662m.mp4", "name": "Stride Jump Crossover", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/837/Male/l/837_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/837/Male/l/837_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Suspend your straps so the handles are 18-30 inches from the floor.", "Facing away from the setup, place your rear foot into the handle behind you. Keep your head looking forward and your chest up, with your knee slightly bent. This will be your starting position.", "Descend by flexing the knee and hips, lowering yourself to the ground. Keep your weight on the heel of your foot and maintain your posture throughout the exercise.", "At the bottom of the movement, reverse the motion, extending through the hip and knee to return to the starting position."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99942m.mp4", "name": "Suspended Split Squat", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1391/Male/l/1391_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/1391/Male/l/1391_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin in a standing position with your feet hip-distance apart and your hands behind your head. Descend into a squat position by bending at the knees and hips. This will be your starting position.", "Take two small jumps out, then two small jumps back in, making sure that your feet never come closer than hip-distance.", "Throughout the entire movement, youâ€™ll want to stay in the squat position, keeping your hips back, butt down, and chest up.", "Continue for the recommended time or number of reps."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123022m.mp4", "name": "Thigh Killa", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5473/Male/l/5473_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5473/Male/l/5473_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin by gripping the bottom of the tire on the tread, and position your feet back a bit. Your chest should be driving into the tire.", "To lift the tire, extend through the hips, knees, and ankles, driving into the tire and up.", "As the tire reaches a 45 degree angle, step forward and drive a knee into the tire. As you do so adjust your grip to the upper portion of the tire and push it forward as hard as possible to complete the turn. Repeat as necessary."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77452m.mp4", "name": "Tire Flip", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/725/Male/l/725_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/725/Male/l/725_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Running or hiking on trails will get the blood pumping and heart beating almost immediately. Make sure you have good shoes. While you use the muscles in your calves and buttocks to pull yourself up a hill, the knees, joints and ankles absorb the bulk of the pounding coming back down. Take smaller steps as you walk downhill, keep your knees bent to reduce the impact and slow down to avoid falling.", "A 150 lb person can burn over 200 calories for 30 minutes walking uphill, compared to 175 on a flat surface. If running the trail, a 150 lb person can burn well over 500 calories in 30 minutes."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/72000/72402m.mp4", "name": "Trail Running/Walking", "type": "cardio", "equipment": "none", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/657/Male/l/657_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/657/Male/l/657_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["For this exercise load a trap bar, also known as a hex bar, to an appropriate weight resting on the ground. Stand in the center of the apparatus and grasp both handles.", "Lower your hips, look forward with your head and keep your chest up.", "Begin the movement by driving through the heels and extend your hips and knees. Avoid rounding your back at all times.", "At the completion of the movement, lower the weight back to the ground under control."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/90000/91072m.mp4", "name": "Trap Bar Deadlift", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/921/Male/l/921_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/921/Male/l/921_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["For this exercise load a trap bar with bumper plates using an appropriate weight. Stand in the center of the trap bar with your feet about shoulder-width apart. Bend down and grasp both handles, making sure to keep your hips back, chest lifted and back straight This will be your starting position.", "Start the pull by driving your feet into the floor. Extend at the ankles, knees and hips to allow you to jump of the ground.", "When you land, keep your knees soft and return the weight to the starting position. Feet should stay about hip-width apart on takeoff and landing.", "Repeat for the recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/121051m.mp4", "name": "Trap Bar Jump", "type": "plyometrics", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4561/Male/l/4561_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4561/Male/l/4561_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["From a standing position, raise your left hand reaching as high as you can, while driving your right knee up in a similar movement to a traditional mountain climber.", "Switch by pulling down with your left hand and reaching high with your right hand. At the same time, let your right foot fall to the floor, then drive with your lift knee up.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117182m.mp4", "name": "Vertical Mountain Climber", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3013/Male/l/3013_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3013/Male/l/3013_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Begin standing with your feet shoulder-width apart. Your arms should be bent and at your sides.", "Lift your right knee up until it reaches your waist. Your left arm should swing forward while your right arm swings back.", "Return your right foot to the ground as you lift your left knee. Swing your right arm forward and your left arm back.", "Repeat."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/118000/118381m.mp4", "name": "Walking High Knees", "type": "cardio", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3053/Male/l/3053_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3053/Male/l/3053_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Select a plate that youâ€™re able to hold overhead for a time of at least 30 seconds. Grasping the plate with both hands, raise it overhead until your arms are fully extended. Stand with your feet shoulder-width apart, arms fully extended overhead. This will be your starting position.", "Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee touches the ground. Your posture should remain upright, and your front knee should stay above the front foot.", "Drive through the heel of your lead foot and extend both knees to raise yourself back up. Step forward with your rear foot, repeating the lunge on the opposite leg.", "Repeat for recommended number of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120391m.mp4", "name": "Walking Lunge With Overhead Weight", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4301/Male/l/4301_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4301/Male/l/4301_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.", "Treadmills offer convenience, cardiovascular benefits, and usually have less impact than walking outside. When walking, you should move at a moderate to fast pace, not a leisurely one. Being an activity of lower intensity, walking doesnâ€™t burn as many calories as some other activities, but still provides great benefit. A 150 lb person will burn about 175 calories walking 4 miles per hour for 30 minutes, compared to 450 calories running twice as fast. Maintain proper posture as you walk, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/70000/71942m.mp4", "name": "Walking, Treadmill", "type": "cardio", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/658/Male/l/658_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/658/Male/l/658_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand with your feet shoulder width apart, facing a wall, and holding a medicine ball at your chest. Keep your shoulders back and keep your chest up high. Stand 3 to 5 feet from the wall. This will be your staring position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "Drive through your heels to ascend. As you begin to drive upwards, push the medicine ball up towards the wall by fully extending the arms. Aim to throw the ball to a height of 10 to 12 feet.", "Catch the ball and return to the starting position. Immediately begin the next repetition.", "Repeat for recommended number of repetitions"], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120431m.mp4", "name": "Wall Ball Squat", "type": "plyometrics", "equipment": "medicineball", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4151/Male/l/4151_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4151/Male/l/4151_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin by standing with your feet arms distance away from the wall. Turn so that your back is facing the wall. Position your feet so that they are shoulder-width apart and place your hands on the floor with your shoulders stacked over your hands and wrists. Keep your knees bent and your hips back. This will be your starting position.", "Jump your feet back, quickly touching the wall with your feet. Make sure to keep your hips up and back flat.", "Return to the starting position before standing all the wall up. This is one repetition. Complete for the recommended number of repetitions or time."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/123072m.mp4", "name": "Wall Sprawl", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5223/Male/l/5223_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/5223/Male/l/5223_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin with your back against the wall and your feet 18-24 inches out in front of you. Have your feet in a shoulder-width stance, toes pointed slightly outward and knees slightly out. This will be your starting position.", "Descend slowly by â€˜slidingâ€™ down the wall. Keep your head up and maintain a flat back against the wall.", "Continue down until the upper legs are at or just below parallel to the floor. Maintain this position for the recommended amount of time. Focus on breathing continuously throughout.", "Push through your heels to return upwards to the starting position.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120971m.mp4", "name": "Wall Squat", "type": "strength", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4531/Male/l/4531_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4531/Male/l/4531_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Position a lightly loaded barbell across the back of your shoulders. You could also use a weighted vest, sandbag, or other type of resistance for this exercise.", "The weight should be light enough that it doesn't slow you down significantly. Your feet should be just outside of shoulder width with your head and chest up. This will be your starting position.", "Using a countermovement, squat partially down and immediately reverse your direction to explode off of the ground, extending through your hips, knees, and ankles. Maintain good posture throughout the jump.", "As you return to the ground, absorb the impact through your legs."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/98000/99802m.mp4", "name": "Weighted Jump Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/887/Male/l/887_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/887/Male/l/887_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Standing upright, with feet at shoulder width and toes raised, use one hand to hold onto the beams of a squat rack and the opposite arm to hold a plate on top of your chest. This is your starting position.", "As you use one arm to hold yourself, bend at the knees and slowly lower your torso toward the ground by bringing your pelvis and knees forward. Inhale as you go down and stop when your upper and lower legs almost create a 90-degree angle. Hold the stretch position for a second.", "After your one second hold, use your thigh muscles to bring your torso back up to the starting position. Exhale as you move up.", "Repeat for the recommended amount of times."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54581m.mp4", "name": "Weighted Sissy Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/335/Male/l/335_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/335/Male/l/335_2.jpg", "level": "expert"}, {"muscle": "quadriceps", "guide": ["Start by positioning two flat benches shoulder width apart from each other. Stand on top of them and wrap the weighted belt around your waist with the amount of weight you feel comfortable with. Make sure your toes are facing out.", "Once you are standing straight up with the weight hanging in between your legs, position your arms so that they are fully extended to the side of your body. This is the starting position.", "Begin by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that are perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to move the body back up by pushing the floor of the flat bench with the ball of your foot mainly as you straighten the legs again and go back to the starting position. Exhale as you perform this portion of the exercise.", "Repeat for the recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/40000/41621m.mp4", "name": "Weighted Squat", "type": "strength", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/336/Male/l/336_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/336/Male/l/336_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["Begin by loading the bar appropriately and stepping under it, placing it across the back of the shoulders slightly below the rear deltoids in a â€œlow-barâ€\u009d position. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders.", "Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet in a wider-than-shoulder-width stance with the toes slightly pointed out and knees slightly bent. Keep your neck neutral. This will be your starting position.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "Descend into a squat by pushing your hips and butt backwards. Continue down until the upper legs are at or just below parallel to the floor. Inhale as you perform this portion of the movement.", "Drive up through your heels, pushing your feet and knees out. Continue upward, maintaining tightness head to toe, until you have returned to the starting position.", "Repeat for recommended amount of repetitions."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/120000/120911m.mp4", "name": "Wide-Stance Barbell Squat", "type": "strength", "equipment": "barbell", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4501/Male/l/4501_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4501/Male/l/4501_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Stand erect with a wide stance with your hands just off your front thighs. This will be your starting position.", "Descend into a deep squat while simultaneously clasping your hands in front of you, arms drawn in. Rise back up in an explosive motion to bring your feet off the floor, extending your arms again so theyâ€™re touching your thighs. This time as you descend youâ€™ll be going into a close stance, again clasping your hands in front of you.", "Alternate wide and close stances as you repeat the arm movements."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/122000/122811m.mp4", "name": "Wide-Stance Jump Squat To Close-Stance", "type": "plyometrics", "equipment": "bodyonly", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4921/Male/l/4921_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/4921/Male/l/4921_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["Load the sled to an appropriate weight.", "Seat yourself on the machine, planting your feet on the platform spaced widely apart. Ensure that you are pushing your knees out at all times, not allowing them to cave in. Maintain good spinal position with your head and chest up.", "Supporting the weight, fully extend the knees and unlock the sled. This will be your starting position.", "Lower the weight by flexing the hips and knees, continuing as far as flexibility allows. Do not allow your lumbar to take the load by moving your pelvis.", "At the bottom of the motion, pause briefly and return to the starting position by extending at hips and knees."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/116000/117691m.mp4", "name": "Wide-Stance Leg Press", "type": "strength", "equipment": "machine", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3421/Male/l/3421_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/3421/Male/l/3421_2.jpg", "level": "beginner"}, {"muscle": "quadriceps", "guide": ["The yoke is usually done with a yoke apparatus, but is sometimes seen with refrigerators or other heavy objects.", "Begin by racking the apparatus across the back of the shoulders. With your head looking forward and back arched, lift the yoke by driving through the heels.", "Begin walking as quickly as possible using short, quick steps. You may hold the side posts of the yoke to help steady it and hold it in position. Continue for the given distance as fast as possible, usually 75-100 feet."], "video_url": "https://videocdn.bodybuilding.com/video/mp4/76000/77432m.mp4", "name": "Yoke Walk", "type": "strongman", "equipment": "other", "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/726/Male/l/726_1.jpg", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/726/Male/l/726_2.jpg", "level": "intermediate"}, {"muscle": "quadriceps", "guide": ["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. The correct height should be anywhere above the waist but below the chest. Once the correct height is chosen and the bar is loaded, lock your hands together and place the bar on top of your arms in between the forearm and upper arm.", "Lift the bar up so that it is resting on top of your forearms. If you are holding the bar properly, it should look as if you have your arms crossed but with a bar running across them.", "Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).", "Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.", "Begin to raise the bar as you exhale by pushing the floor with the ball of your foot mainly as you straighten the legs again and go back to the starting position.", "Repeat for the recommended amount of repetitions."], "left_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/284/Male/l/284_1.jpg", "name": "Zercher Squats", "type": "strength", "equipment": "barbell", "level": "expert", "video_url": "https://videocdn.bodybuilding.com/video/mp4/54000/54601m.mp4", "right_img_url": "https://www.bodybuilding.com/exercises/exerciseImages/sequences/284/Male/l/284_2.jpg"}]}}